Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/internal.po
Languages: cs, de, ja, pt_br, ru, uk

source: A ``1`` in the ``active`` field shows that the component is active, i.e it is used in the simulation. A ``0`` shows it is inactive.
cs: ``active`` - pokud je zde ``1``, znamená to, že komponenta je aktivní. Například je použita v simulaci. Pokud je zde ``0``, je neaktivní.
de: Eine ``1`` in dem active Feld zeigt an, dass die Komponenten aktiv ist, d.h. dass sie während der Simulation verwendet wird. Eine ``0`` zeigt an, dass die Komponente nicht aktiv ist.
ja: ``active`` 欄の ``1`` は、その部品がアクティブであること、すなわち回路図で使われることを示します。 ``0`` は、アクティブでないという意味です。
pt_br: Um ``1`` no campo active mostra que o componente está ativo, isto é, ele será usado na simulação. Um ``0`` mostra que está desativado.
ru: ``1`` в поле ``active`` ("активный") показывает, что этот компонент активный, то есть используется в моделировании. ``0`` показывает, что он неактивный.
uk: ``1`` на полі ``active`` ("активний") показує, що це компонент активний, тобто використовують у моделюванні. ``0`` показує, що він неактивний.

source: The next two numbers indicate the mirroring about the x axis (``1`` for mirrored, ``0`` for not mirrored) and the counter-clockwise rotation (multiple of 90 degree, i.e. 0...3).
cs: ``mirrorX rotate`` - Následující dvě čísla definují zrcadlení podle osy x (``1`` pro zrcadlení, ``0`` nezrcadlí se) a rotaci ve stupních (proti směru hodinových ručiček).
de: Die nächsten beiden Zahlen zeigen an, ob die Komponente an der x-Achse gespiegelt ist (``1`` für gespiegelt, ``0`` für nicht gespiegelt) ist und ob die Komponente entgegen des Uhrzeigersinns gedreht ist (Vielfache von 90 Grad, d.h. 0...3).
ja: その次の２つの数字は、x軸についてのミラーの有無（``1`` ならミラーあり、０はなし）と逆時計回りの回転（90度の倍数、つまり0...3）を示します。
pt_br: Os próximos dois números indicam o espelhamento sobre o eixo x (``1`` para espelhado, ``0`` não espelhado) e a rotação no sentido anti-horário (multiplos de 90 graus, ex. 0...3).
ru: Следующие два числа указывают на зеркальное отображение относительно оси x (``1`` - зеркальное отображение, ``0`` - нет зеркального отображения) и вращение против часовой стрелки (кратно 90 градусам, то есть 0...3).
uk: Наступні два числа свідчить про дзеркальне відображення щодо осі x (``1`` - дзеркальне відображення, ``0`` - немає дзеркального відображення) і обертання проти годинниковий стрілки (кратно 90 градусів, тобто 0...3).

source: The next entries are the values of the component properties (in quotation marks) followed by an ``1`` if the property is visible on the schematic (otherwise ``0``).
cs: ``Value1 visible`` - Zde se udává hodnota komponenty (v uvozovkách) . Pokud je za ní ``1``, pak bude ve schématu zobrazena. Pokud bude hodnota ``0``, pak nebude ve schématu zobrazena.
de: Die nächsten beiden Einträge sind die Werte der Komponenteneigenschaften (in Anführungszeichen) gefolgt von einer ``1``, falls die Eigenschaft in dem Schaltplan angezeigt wird (ansonsten eine ``0``).
ja: その後は、部品のプロパティの値（引用符の中）とそれに続いて、プロパティが回路図上に表示されるなら ``1`` （そうでなければ ``0`` ）という項目が続きます。
pt_br: As próximas entradas são os valores das propriedades do componente (entre aspas duplas) seguidos por um ``1`` se a propriedade estiver visível no esquema elétrico (caso contrário ``0``).
ru: Следующие параметры являются значениями свойств компонента (в кавычках), за которыми следует ``1``, если это свойство видимо на схеме (в противном случае ``0``).
uk: Наступні параметри є значеннями властивостей компонента (у лапках), що їх слід 1, якщо це властивість певне на схемою (інакше 0).

source: This section starts with ``<Wires>`` and ends with ``</Wires>``. It contains the wires (electrical connection between circuit components) and their labels and node sets. The line format is as follows:
cs: Začíná ``<Wires>`` a končí ``</Wires>``. Obsahuje informace o vedení, které spojuje jednotlivé komponenty (co spojuje, název, atd.). Formát je následující:
de: Der Abschnitt beginnt mit ``<Wires>`` und endet mit ``</Wires>``. Er beinhaltet die Drähte (elektrische Verbindungen zwischen den Schlatkreiskomponenten) und ihre Bezeichnungen bzw. zusätzlichen Eigenschaften. Das Zeilenformat sieht wie folgt aus:
ja: このセクションは、 ``<Wires>`` で始まり、 ``</Wires>`` で終わります。これには、配線（回路部品の間の電気的な結線）とそれらのラベルとノードセット情報が含まれます。行の形式は以下のようになります：
pt_br: Esta seção começa com ``<Wires>`` e termina com ``</Wires>``. Ela contém os fios (conexão elétrica entre os componentes do circuito) e seus rótulos e nós. O formato da linha é como se segue:
ru: Этот раздел начинается с ``<Wires>`` и заканчивается ``</Wires>``. Он содержит проводники (электрическое соединение между компонентами цепи), их метки и узлы. Формат строки:
uk: Цей розділ починається з ``<Wires>`` і закінчується ``</Wires>``. Він містить провідники (електричне з'єднання між компонентами електричного кола), їх мітки і вузли. Формат рядку:

source: This section starts with ``<Diagrams>`` and ends with ``</Diagrams>``. It contains the diagrams with their graphs and their markers. The line format is as follows (line break not allowed):
cs: Začíná ``<Diagrams>`` a končí ``</Diagrams>``. Obsahuje diagramy s jejich grafy a značkami. The line format is as follows (line break not allowed):
de: Der Abschnitt beginnt mit `<Diagrams>`` und endet mit ``</Diagrams>``. Er beinhaltet die Diagramme mit ihren Kurven und Markierungen."
ja: このセクションは ``<Diagrams>`` で始まり ``</Diagrams>`` で終わります。これは、グラフとマーカの図を含みます。行の形式は以下の通りです（改行は禁止されてます）：
pt_br: Esta seção começa com ``<Diagrams>`` e termina com ``</Diagrams>``. Ela contém os diagramas com seus gráficos e seus marcadores.
ru: Этот раздел начинается с ``<Diagrams>`` и заканчивается ``</Diagrams>``. Он содержит диаграммы с их графиками и маркерами." The line format is as follows (line break not allowed):

source: This section starts with ``<Paintings>`` and ends with ``</Paintings>``. It contains the paintings that are within the schematic.
cs: Začíná znaky ``<Paintings>`` a končí ``</Paintings>``. Obsahuje obrazce, které jsou ve schématu.
de: Der Abschnitt beginnt mit ``<Paintings>`` und endet mit ``</Paintings>``. Er beinhaltet die Zeichnungselemente, die sich in dem Schaltplan befinden."
ja: このセクションは ``<Paintings>`` で始まり、 ``</Paintings>`` で終わります。これには、回路図に含まれる絵柄が入っています。
pt_br: Esta seção começa com ``<Paintings>`` e termina com ``</Paintings>``. Ela contém as pinturas que estão dentro do esquema elétrico.
ru: Этот раздел начинается с ``<Paintings>`` и заканчивается ``</Paintings>``. Он содержит элементы рисования, которые используются в схеме.
