Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/internal.po
Languages: cs, de, ja, pt_br, ru, uk

source: Schematic File Format
cs: Popis k formátu souborů
de: Dateiformat der Schaltpläne
ja: 回路図ファイルの形式
pt_br: Formato dos Arquivos de Diagrama Elétrico
ru: Формат схемного файла
uk: Формат схемного файлу

source: Properties
cs: Vlastnosti (Properties)
de: Eigenschaften
ja: プロパティー

source: Components
cs: Components (Komponenty)
de: Komponenten
ja: 部品

source: The next two numbers are the x and y coordinates of the component center.
cs: "x y" - Tyto dvě čísla určují, polohu komponenty (resp. kde se bude nacházet její střed).
de: Die nächsten beiden Zahlen sind die x- und y-Koordinaten des Komponentenzentrums.
ja: 次の２つの数字は、部品の中心のx座標とy座標です。
pt_br: Os próximos dois números são as coordenadas x e y do centro do componente.
ru: Следующие два числа являются x и y координатами центра компонента.
uk: Наступні два числа є x і y координатами центру компонента.

source: The next two numbers are the x and y coordinates of the upper left corner of the component text. They are relative to the component center.
cs: "xtext ytext" - Tato čísla určují polohu textu, který slouží jako popisek pro určitou komponentu (resp. určuje, kde se bude nacházet horní levý roh popisku). Tyto údaje udávají vzdálenost od středu komponenty.
de: Die folgenden beiden Zahlen sind die x- und y-Koordinaten der linken oberen Ecke des Komponententextes. Sie sind relativ zum Komponentenzentrum.
ja: その次の２つの数字は、部品についてのテキストの左上のコーナのx座標とy座標です。それらは、部品の中心に対する相対位置です。
pt_br: Os próximos dois números são as coordenadas x e y do canto superior esquerdo da componete de texto. Elas são relativas ao centro do componente.
ru: Следующие два числа являются x и y координатами верхнего левого угла текста компонента. Они отсчитываются от центра компонента.
uk: Наступні два числа є x і y координатами верхнього лівого кута тексту компонента. Вони відраховуються від центру компонента.

source: Wires
cs: Vedení
de: Verbindungen

source: The first four numbers are the coordinates of the wire in pixels: x coordinate of starting point, y coordinate of starting point, x coordinate of end point and y coordinate of end point. All wires must be either horizontal (both x coordinates equal) or vertical (both y coordinates equal).
cs: "x1 y1 x2 y2" - Tyto čtyři čísla určují počátek (x1, y1) a konec (x2, x2) vodiče. Veškeré vodiče musí být ve vodorovné, nebo horizontální poloze (tzn. že budou obě xové, nebo obě ypsylonové souřadnice stejné).
de: Die ersten vier Zahlen sind die Koordinaten des Drahtes in Pixel: x-Koordinate des Startpunktes, y-Koordinate des Startpunktes, x-Koordinate des Endpunktes und y-Koordinate des Endpunktes. Alle Drähte müssen entweder horizontal (beide x-Koordinaten gleich) oder vertikal (beide y-Koordinaten gleich) sein.
ja: 最初の４つの数字は、配線のピクセル座標：開始点のx座標、開始点のy座標、終止点のx座標と終止点のy座標、です。すべての配線は、水平方向（両方のx座標が同じ）または垂直方向（y座標が同じ）でなくてはなりません。
pt_br: Os primeiros quatro números são as coordenadas do fio em pixels: coordenada x do ponto inícial, coordenada y do ponto inicial, coordenada x do ponto final e coordenada y do ponto final. Todos os fios devem ser horizontais (ambas coordenadas x iguais) ou verticais (ambas coordenadas y iguais).
ru: Первые четыре числа являются координаиами проводника в пикселах: x-координата начальной точки, y-координата начальной точкиt, x-координата конечной точки и y-координата конечной точки. Все проводники должны быть либо горизонтальными (обе x-координаты равны), либо вертикальными (обе y-координаты равны).
uk: Цей розділ починається з "<Wires>" і закінчується "</Wires>". Він містить провідники (електричне з'єднання між компонентами електричного кола), їх мітки і вузли. Формат рядку: <code><x1 y1 x2 y2 "label" xlabel ylabel dlabel "node set"></code>

source: The first string in quotation marks is the label name. It is empty if the user has not set a label on this wire.
cs: ""label"" - Tato proměnná nastavuje popisek. Pokud je prázdná, znamená to, že vodiči nedal uživatel žádný název.
de: Die erste Zeichenkette in Anführungszeichen ist der Name des Bezeichners. Er ist leer, wenn der Benutzer keine Drahtbezeichnung eingegeben hat.
ja: 引用符に囲まれた最初の文字列はラベルの名前です。それは配線にラベルが 付けられていなければ 空白です。
pt_br: A primeira propriedade entre aspas duplas é o rótulo. Ela fica vazia se nenhum rótulo for atribuído a este fio.
ru: Первая строка в кавычках - имя метки. Она пустая, если пользователь не установил метку на этот проводник.
uk: Перший рядок у лапках - ім'я мітки. Вона порожня, якщо користувач не встановив мітку на цей провідник.

source: The next two numbers are the x and y coordinates of the label or zero if no label exists.
cs: "xlabel ylabel" - Další dvě čísla jsou xové a ypsylonové souřadnice popisku. Pokud jsou zde nuly, znamená to, že popisek neexistuje.
de: Die nächsten beiden Zahlen sind die x- und y-Koordinaten der Bezeichnung oder Null, falls es keine Bezeichnung gibt.
ja: 次の２つの数字は、ラベルのx座標とy座標であり、ラベルが 無ければ０です。
pt_br: Os próximos dois números são as coordenadas x e y do rótulo ou zero se o rótulo não existir.
ru: Следующие два числа - x- и y-координаты метки или ноль, если метки не существует.
uk: Наступні два числа - x- і y-координати мітки чи нуль, якщо мітки немає.

source: The next number is the distance between the wire starting point and and the point where the label is set on the wire.
cs: "dlabel" - Číslo určuje vzdálenost mezi počátečním bodem vodiče a popiskou vodiče.
de: Die folgenden beiden Zahlen sind der Abstand zwischen dem Startpunkt des Drahtes und dem Punkt, an dem der Bezeichner des Drahtes angezeigt werden soll.
ja: その次の数字は、配線の開始点と配線に付けられたラベルの位置の間の距離です。
pt_br: O próximo número é a distância entre o ponto de início do fio e o ponto onde o rótulo for atribuído no fio.
ru: Следующее число является расстоянием между начальной точкой проводника и точкой, где на проводнике установлена метка.
uk: Наступне число є відстанню між початковою точкою провідника і точкою, де на провіднику встановлено мітку.

source: The last string in quotation marks is the node set of the wire, i.e. the initial voltage at this node used by the simulation engine to find the solution. This is empty if the user has not set a node set for this wire.
cs: ""node set"" - Text v uvozovkách udává jméno uzlu vodiče. Např.: počáteční napětí na tomto uzlu je právě jméno uzlu tohoto vodiče, pak se engine pokusí najít řešení. Pokud je tato položka prázdná, znamená to, že uživatel nenastavil jméno uzlu pro daný vodič.
de: Die letzte Zeichenkette in Anführungszeichen ist der Anfangswert für die Knotenspannung an diesem Draht. Sie ist leer, falls der Benutzer keine Knotenspannung für diesen Draht angegeben hat..
ja: 最後の引用符に囲われた文字列は、この配線のノードセット電圧、すなわちシミュレーションエンジンが解を見つかるために使うノード電圧の初期値です。この配線がユーザによりノードセットされていなければ空白です。
pt_br: A última propriedade entre aspas duplas é o nó do fio, ex. a tensão inicial neste nó usada pela simulador para encontrar a solução. Este fica vazio se o usuário não definir um nó para este fio.
ru: Последняя строка в кавычках - параметры цепи проводника, то есть начальное напряжение узла, используемое ядром симулятора для поиска решения. Эта строка пустая, если пользователь не установил параметры узла цепи для этого проводника.
uk: Останній рядок у лапках - параметри кола провідника, тобто початкова напруга вузла, що використовується ядром симулятора для пошуку рішення. Цей рядок порожній, якщо користувач не встановив параметри вузла електричного кола для цього провідника.

source: Diagrams
cs: Diagramy
de: Diagramme

source: The first two numbers are x and y coordinate of lower left corner.
cs: "x y" - Tyto čísla určují pozici spodního levého rohu.
de: Die ersten beiden Zahlen sind die x-und y-Koordinaten der linken unteren Ecke.
ja: 最初の２つの数字は、左上コーナのx座標とy座標です。
pt_br: Os primeiros dois números são as coordenadas x e y do canto esquerdo inferior.
ru: Первые два числа - это x- и y-координаты нижнего левого угла.
uk: Перші два числа - це x- і y-координати нижнього лівого кута.

source: The next two numbers are width and height of diagram boundings.
cs: "width height" - Následující čísla udávají šířku a výšku diagramu.
de: Die nächsten beiden Zahlen sind die Breite und Höhe der Diagrammgrenzen.
ja: 次の２つの数字は、図の境界の幅と高さです。
pt_br: Os dois números seguintes são a largura e altura de limitação do diagrama.
ru: Следующие два числа - ширина и высота границ диаграммы.
uk: Наступні два числа - ширина і висота границь діаграми.

source: The fifth number is 1 if grid is on and 0 if grid is off.
cs: "grid" - Pokud je zde 1, pak bude zobrazena mřížka. Pokud zde bude 0, pak mřížka nebude zobrazena.
de: Die fünfte Zahl ist 1 falls das Gitternetz angezeigt werden soll und 0 falls nicht.
ja: ５番目の数字は、グリッドがオンなら１、オフなら０です。
pt_br: O quinto número é 1 se a grade estiver ligada e 0 se estiver desligada.
ru: Пятое число равно 1, если сетка включена, и 0, если сетка выключена.
uk: П'яте число рівно 1, якщо сітка включена, і 0, якщо сітка виключена.

source: The next is grid color in 24 bit hexadecimal RGB value, e.g. #FF0000 is red.
cs: "gridcolor" - Zde je udána 24. bitová barva v hexadecimální RGB hodnotě. Např.: #FF0000 je červená.
de: Das nächste ist die Farbe des Gitternetzes als hexadezimaler 24-Bit RGB-Wert, z.B. ist #FF0000 rot.
ja: その次は、グリッドの色を24ビットの16進数のRGB値（例えば、#FF0000は赤をあらわす）です。
pt_br: O próximo é a cor da grade em valor RGB hexadecimal de 24 bits, ex. #FF0000 é vermelho.
ru: Дальше идет цвет сетки в виде 24-битного шестнадцатиричного RGB значения, например, #FF0000 - красный.
uk: Далі йде колір сітки як 24-бітне шістнадцяткове RGB значення, наприклад, #FF0000 - червоний.

source: The next number determines the style of the grid.
cs: "gridstyle" - Určuje styl mřížky.
de: Die nächste Zahl legt den Stil des Gitternetzes fest.
ja: その次の数字は、グリッドのスタイルを決定します。
pt_br: O próximo número determina o estilo da grade.
ru: Следующее число определяет стиль сетки.
uk: Наступне число визначає стиль сітки.

source: The next number determines which axes have logarithmical scale.
cs: Zbylá čísla určují jak "osekáme" logaritmickou stupnici.
de: Die nächste Zahl legt fest, welche Achsen eine logarithmische Einteilung haben.
ja: その次の数字は、どの軸がログスケールかを決めるものです。
pt_br: O próximo número determina quais eixos tem escala locarítmica.
ru: Следующее число определяет, какие оси имеют логарифмический масштаб.
uk: Наступне число визначає, які осі мають логарифмічний масштаб.

source: Paintings
cs: Obrazce
de: Zeichnungen

source: This document describes the schematic file format of Qucs. This format is used for schematics (usually with suffix ``.sch``) and for data displays (usually with suffix ``.dpl``). The following text shows a short example of a schematic file.
cs: Tento dokument popisuje formát souborů. Tento formát je používán pro schémata (obvykle s příponou ``.sch``) a pro soubory, které zobrazují výstupní data (obvykle s příponou ``.dpl``). Následující text názorně ukazuje příklad souboru se sechématem.
de: Dieses Dokument beschreibt kurz das Dateiformat der Schaltpläne von Qucs. Das Format wird für Schaltpläne (normalerweise mit der Dateiendung ``.sch``) und für Datenvisualisierungen (normalerweise mit der Dateiendung ``.dpl``) verwendet. Der folgende Text zeigt ein kurzes Beispiel für eine solche Datei.
ja: この文書は、Qucsの回路図ファイルの形式について記述します。この形式は、回路図（通常修飾子は ``.sch`` ）とデータ表示（通常修飾子は ``.dpl`` ）に使われます。以下のテキストは、回路図ファイルの短い例です。
pt_br: Este documento descreve o formato dos arquivos de diagrama elétrico do Qucs. Este formato é utilizado para diagramas elétricos (normalmente com o sufixo ``.sch``) e para exibir dados (normalmente com o sufixo ``.dpl``). O texto abaixo mostra um exemplo curto de um arquivo de diagrama elétrico.
ru: В этом документе описывается формат схемного файла Qucs. Этот формат используется для схем (обычно с расширением ``.sch``) и для просмотров данных (обычно с расширением ``.dpl``). В следующем тексте приводится краткий пример схемного файла.
uk: У документі описується формат схемного файлу Qucs. Цей формат використовується для схем (звичайно з розширенням ``.sch``) й для перегляду даних (звичайно з розширенням ``.dpl``). Наступний текст наводить короткий приклад схемного файлу.

source: The file contains several section. Each of it is explained below. Every line consists of not more than one information block that starts with a less-sign ``<`` and ends with a greater-sign ``>``.
cs: Každý řádek obsahuje mnoho sekcí. Každá je vysvětlena níže. Každá řádka neobsahuje více jak jeden blok informací které začínají znakem ``<`` a končí znakem ``>``.
de: Die Datei beinhaltet mehrere Abschnitte. Jeder dieser Abschnitte wird nachfolgend erklärt. Jede Zeile besteht aus einem einzigen Informationsblock, der mit dem Kleiner-Zeichen ``<`` beginnt und mit dem Größer-Zeichen ``>`` endet.
ja: このファイルにはいくつかのセクションが入っています。以下でそれぞれを説明します。すべての行は、小なり記号（＜）で始まり大なり記号（＞）で終わる１つを 超えることのない情報ブロックから構成されます。
pt_br: O arquivo contém várias seções. Cada uma delas é explicada abaixo. Cada linha consiste em nada mais que um bloco de informação que começa com um sinal de menor ``<`` e termina com um sinal de maior ``>``.
ru: В файле несколько разделов. Все они объясняются ниже. Каждая линия состоит из не более чем одного информационного блока, начинающегося знаком ``меньше`` (``<``) и заканчивающегося знаком ``больше`` (``>``).
uk: У файлі є кілька розділів. Усі вони пояснюються нижче. Кожна лінія складається лише з одного інформаційного блоку, який починається знаком "менше" (``<``) і який закінчується знаком "більше" (``>``).

source: The first section starts with ``<Properties>`` and ends with ``</Properties>``. It contains the document properties of the file. Each line is optional. The following properties are supported:
cs: První část začíná s ``<Properties>`` a končí ``</Properties>``. Tento blok obsahuje vlastnosti souboru dokumentu. Každá řádka je volitelná (neí třeba vše definovat). Následující vlastnosti jsou podoprovány:
de: Der erste Abschnitt beginnt mit ``<Properties>`` und endet mit ``</Properties>``. Er beinhaltet die Dokumenteneigenschaften der Datei. Jede dieser Zeilen ist optional. Die folgenden Eigenschaften werden unterstützt.
ja: この最初のセクションは ``<Properties>`` で始まり、 ``</Properties>`` で終わります。 これには、ファイルの文書としてのプロパティが含まれます。以下のようなプロパティがサポートされています：
pt_br: A primeira seção começa com ``<Properties>`` e termina com ``</Properties>``. Ela contém as propriedades de documento do arquivo. Cada uma das linhas é opcional. As seguintes propriedades são suportadas:
ru: Первый раздел начинается с ``<Properties>`` и заканчивается ``</Properties>``. Он содержит свойства документа, находящегося в файле. Каждая строка необязательна. Поддерживаются следующие свойства:
uk: Перший розділ починається з ``<Properties>`` і закінчується ``</Properties>``. Він містить властивості документа, що знаходиться у файлі. Кожний рядок необов'язковий. Підтримуються такі властивості:

source: ``<View=x1,y1,x2,y2,scale,xpos,ypos>`` contains pixel position of the schematic window in the first four numbers, its current scale and the current position of the upper left corner (last two numbers).
cs: ``<View=x1,y1,x2,y2,scale,xpos,ypos>`` první čtyři čísla udávají pozici okna se shématem. Je to současná velikost tohoto okna a pozice levého horního rohu (poslední dvě čísla).
de: ``<View=x1,y1,x2,y2,scale,xpos,ypos>`` beinhaltet die Pixelposition des Schaltplanfensters in den ersten vier Zahlen, die aktuelle Skalierung und die aktuelle Position der linken oberen Ecke (die letzten beiden Zahlen).
ja: ``<View=x1,y1,x2,y2,scale,xpos,ypos>`` には、最初の４つの数字で、回路図ウィンドウのピクセルの位置、（最後の２つの数で）現在のスケール、それから現在の左上のコーナの位置が入っています。
pt_br: ``<View=x1,y1,x2,y2,scale,xpos,ypos>`` contém a posição dos pixels da janela do esquema elétrico nos primeiros quatro números, sua escala atual e a posição atual do canto superior esquerdo (dois últimos números).
ru: ``<View=x1,y1,x2,y2,scale,xpos,ypos>`` содержит положение в пикселах окна схемы (первые четыре числа), его текущий масштаб и текущее положение верхнего левого угла (два последних числа).
uk: ``<View=x1,y1,x2,y2,scale,xpos,ypos>`` містить становище у пікселях вікна схеми (перші чотири числа), його поточний масштаб і поточний стан верхнього лівого кута (останні два числа).

source: ``<Grid=x,y,on>`` contains the distance of the grid in pixel (first two numbers) and whether grid is on (last number 1) or off (last number 0).
cs: ``<Grid=x,y,on>`` udává rozestup v mřížce v pixelech (první dvě čísla) a jestli je zapnut (poslední číslo je 1), nebo vypnut (poslední číslo je 0).
de: ``<Grid=x,y,on>`` beinhaltet den Gitternetzabstand in Pixeln (die ersten beiden Zahlen) und ob das Gitternetz sichtbar ist (letzte Zahl 1) oder nicht (letzte Zahl 0).
ja: <Grid=x,y,on> には、グリッドの距離をピクセルで（最初の２つの数字）、それからグリッドがオン（最後の数字が１）かオフ（最後の数字が０）かを含んでいます。
pt_br: ``<Grid=x,y,on>`` contém a distância da grade em pixels (primeiros dois números) e se a grade está ligada (último número 1) ou desligada (último número 0).
ru: ``<Grid=x,y,on>`` содержит шаг сетки в пикселах (первые два числа) и включена сетка (последнее число = 1) или выключена (последнее число = 0).
uk: ``<Grid=x,y,on>`` містить крок сітки в пікселях (перші два числа) і включена сітка (останнє число = 1) чи виключена (останнє число = 0).

source: ``<DataSet=name.dat>`` contains the file name of the data set associated with this schematic.
cs: ``<DataSet=name.dat>`` Do tohoto souboru se ukládají výsledky ze simulace.
de: ``<DataSet=name.dat>`` beinhaltet den Dateinamen des Datensatzes, der mit diesem Schaltplan assoziiert wird.
ja: <DataSet=name.dat> は、この回路図に関係したデータセットの名前を含みます。
pt_br: ``<DataSet=name.dat>`` contém o nome do arquivo de dados associado com este esquema elétrico.
ru: ``<DataSet=name.dat>`` содержит имя файла набора данных, связанного с этой схемой.
uk: ``<DataSet=name.dat>`` містить ім'я файлу набору даних, зв'язаного з цією схемою.

source: ``<DataDisplay=name.dpl>`` contains the file name of the data display page associated with this schematic (or the file name of the schematic if this document is a data display).
cs: ``<DataDisplay=name.dpl>`` Do tohoto souboru se ukládají další informace o simulaci.
de: ``<DataDisplay=name.dpl>`` beinhaltet den Dateinamen der Datenvisualisierung, die mit diesem Schaltplan assoziiert wird (bzw. den Dateinamen des Schaltplan, falls das Dokument eine Dateinvisualisierung ist).
ja: ``<DataDisplay=name.dpl>`` には、この回路図に関係したデータ表示のページのファイル名（または、文書がデータ表示であるなら、回路図の名前）が含まれます。
pt_br: ``<DataDisplay=name.dpl>`` contém o nome do arquivo de exibição de dados associado com o esquema elétrico (ou nome do arquivo de esquema elétrico se este documento for um arquivos de exibição de dados).
ru: ``<DataDisplay=name.dpl>`` содержит имя файла со страницей просмотра данных, связанной с этой схемой (или имя схемного файла, если этот документ является просмотром данных).
uk: ``<DataDisplay=name.dpl>`` містить ім'я файлу з сторінкою перегляду даних, зв'язаного з цією схемою (чи ім'я схемного файла, чи цей документ є переглядом даних).

source: ``<OpenDisplay=yes>`` contains 1 if the data display page opens automatically after simulation, otherwise contains 0.
cs: ``<OpenDisplay=yes>`` obsahuje 1 pokud se stránka ``DataDisplay`` má automaticky otevří po simulaci. V opačném případě obsahuje 0.
de: ``<OpenDisplay=yes>`` beinhaltet eine 1, falls die Datenvisualisierung automatisch nach der Simulation angezeigt werden soll, anderenfalls eine 0.
ja: <OpenDisplay=yes> には、もしもデータ表示のページがシミュレーション後に自動的に開くなら１、そうでなければ０が入ります。
pt_br: ``<OpenDisplay=yes>`` contém 1 se a página de exibição de dados abrir automaticamente após a simulação, caso contrário contém 0.
ru: ``<OpenDisplay=yes>`` содержит 1, если страница показа данных открывается автоматически после моделирования, в противном случае - 0.
uk: ``<OpenDisplay=yes>`` містить 1, якщо сторінка показу даних відкривається автоматично після моделювання, інакше - 0.

source: This section starts with ``<Symbol>`` and ends with ``</Symbol>``. It contains painting elements creating a schematic symbol for the file. This is usually only used for schematic files that meant to be a subcircuit.
cs: Začíná znaky ``<Symbol>`` a končí ``</Symbol>``. Obsahuje grafické součásti, které tvoří schématický symbor pro soubor. Toto je často používáno pro soubory schémat, které bývají později použity jako vnořené obvody.
de: Dieser Abschnitt beginnt mit ``<Symbol>`` und endet mit ``</Symbol>``. Er beinhaltet die Zeichnungselemente, die das Schaltplansymbol dieser Datei bilden. Das wird normalerweise nur bei Schaltplänen verwendet, die eine Unterschaltung darstellen.
ja: このセクションは ``<Symbol>`` ではじまり </Symbol> で終わります。これには、ファイルに対する回路図シンボルを生成する作図要素が含まれます。これは、通常サブサーキットのための回路図ファイルのためだけに使われます。
pt_br: Esta seção começa com ``<Symbol>`` e termina com ``</Symbol>``. Ela contém os elementos desenhados criando um esquema elétrico simbólico para o arquivo. Isto só é normalmente usado para arquivos de esquemas elétricos que signifiquem estar em subcircuitos.
ru: Этот раздел начинается с ``<Symbol>`` и заканчивается ``</Symbol>``. Он содержит элементы рисования, составляющие схемное обозначение для файла. Это обычно используется только для схемных файлов, которые считаются подсхемой.
uk: Цей поділ починається з ``<Symbol> `` і закінчується ``</Symbol> ``. Він містить елементи малювання, складові схемне позначення для файла. Це зазвичай використовується лише у схемних файлів, які вважають підсхемою.

source: This section starts with ``<Components>`` and ends with ``</Components>``. It contains the circuit components of the schematic. The line format is as follows:
cs: Začíná znaky ``<Components>`` a končí ``</Components>``. Obsahuje komponenty obvodů ve schématech. Formát je následující:
de: Dieser Abschnitt beginnt mit ``<Components>`` und endet mit ``</Components>``. Er beinhaltet die Schaltkreiskomponenten des Schaltplans. Das Zeilenformat ist wie folgt aufgebaut:
ja: このセクションは``<Components>`` で始まり </Components> で終わります。 これには、回路図の回路部品を含みます。各行のフォーマットは以下の通りです：
pt_br: Esta seção começa com ``<Components>`` e termina com ``</Components>``. Ela contém os componentes do circuito do esquema elétrico. O formato da linha é como se segue:
ru: Этот раздел начинается с ``<Components>`` и заканчивается ``</Components>``. Он содержит компоненты цепей схемы. Формат строки:
uk: Цей розділ починається з ``</Components>`` і закінчується ``</Components>``. Він містить компоненти ланцюгів схеми. Формат рядки:

source: The ``type`` identifies the component, e.g. ``R`` for a resistor, ``C`` for a capacitor.
cs: ``type`` - identifikuje komponenty. Např.: ``R`` jako rezistor, ``C`` jako kapacitu.
de: Der ``type`` identifiziert die Komponente, z.B. steht ``R`` für einen Widerstand und ``C`` für einen Kondensator.
ja: ``type`` は、部品の識別するもので、例えば抵抗なら ``R`` 、キャパシタなら C です。
pt_br: ``type`` identifica o componente, ex. ``R`` para um resistor, ``C`` para um capacitor.
ru: ``type`` ("тип") означает компонент, например, ``R`` для резистора, ``C`` для конденсатора.
uk: ``type`` ("тип") означає компонент, наприклад, ``R`` для резистора, ``З`` для конденсатора.

source: The ``name`` is the unique component identifier of the schematic, e.g. ``R1`` for the first resistor.
cs: ``name`` - toto je zcela jedinečný identifikátor ve schématu. Např.: ``R1`` pro první rezistor.
de: Der ``name`` ist der Komponentenidentifizierer in dem Schaltplan, z.B. steht ``R1`` für den ersten Widerstand.
ja: ``name`` は、回路図中の部品のユニークな識別子、例えば最初の抵抗なら``R1`` です。
pt_br: ``name`` é o identificador único para o componente do esquema elétrico, ex. ``R1`` para o primeiro resistor.
ru: ``name`` ("имя") - уникальное обозначение компонента на схеме, например, ``R1`` для первого резистора.
uk: ``name`` ("ім'я") - унікальне позначення компонента на схемою, наприклад, ``R1`` на першому резистора.
