Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/matching.po
Languages: cs, de, ja, pt_br, ru, uk

source: Matching Circuits
cs: Laděné obvody
de: Anpassungsnetzwerke
ja: マッチング回路
pt_br: Circuitos de Casamento
ru: Согласование цепей
uk: Узгодження електричних кіл

source: Creating matching circuits is an often needed task in microwave technology. Qucs can do this automatically. These are the neccessary steps:
cs: Vytváření laděných obvodů je občas potřeba v mikrovlnné technologii. Qucs může toto dělat automaticky. Zde jsou nezbytné kroky:
de: Das Erstellen von Anpassschaltungen ist eine häufig anzutreffende Aufgabe in der Mikrowellentechnik. Qucs kann das automatisch. Dies sind die dazu notwendigen Schritte:
ja: マイクロウェーブ技術では、マッチング回路を作成する必要がしばしばあります。Qucsはこれを自動的に行います。これらは必要なステップです：
pt_br: Criar circuitos de casamento é uma tarefa frequentemente necessária na tecnologia de microondas. Qucs pode fazer isso automaticamente. Estes são os passos necessarios:
ru: Создание согласованных цепей часто требуется в микроволновой технологии. Qucs может делать это автоматически. Необходимые шаги для этого:
uk: Створення узгоджених електричних кіл часто потрібне для мікрохвильової технології. Qucs може робити це автоматично. Необхідні для цього кроки:

source: Perform an S-parameter simulation in order to calculate the reflexion coefficient.
cs: Vykonat simulaci s S-parametrem aby se vypočítal činitel odrazu.
de: Durchführen einer S-Parameter-Simulation zur Berechnung der Reflektionsfaktoren.
ja: 反射係数を計算するためにS−パラメータシミュレーションを実行する。
pt_br: Faça uma simulação de parâmetro-S para calcular o coeficiente de reflexão.
ru: Выполнить моделирование S-параметров, чтобы рассчитать коэффициент отражения.
uk: Виконати моделювання S-параметрів, щоб розрахувати коефіцієнт відображення.

source: Place a diagram and display the reflexion coefficient (i.e. S[1,1] for port 1, S[2,2] for port 2 etc.)
cs: Umístit diagram a zobrazit činitel odrazu (Např.: S[1,1] pro port 1, S[2,2] pro port 2 atd.)
de: Einfügen eines Diagramms zur Darstellung eines Reflektionsfaktors (z.B. S[1,1] für Tor 1, S[2,2] für Tor 2 usw.)
ja: グラフを配置して、反射係数(すなわち、port 1ならS[1,1]、port 2ならS[2,2]など）を表示する。
pt_br: Coloque um diagrama e exiba o coeficiente de reflexão (ex. S[1,1] para port 1, S[2,2] para port 2 etc.)
ru: Вставить диаграмму, чтобы показать коэффициент отражения (то есть, S[1,1] для порта 1, S[2,2] для порта 2 и т.д.)
uk: Вставити діаграму, щоб показати коефіцієнт відображення (тобто, S[1,1] для порту 1, S[2,2] для порту 2 тощо.)

source: Set a marker on the graph and step to the desired frequency.
cs: Nastavit tvůrce grafu a nastavit požadovanou frekvenci.
de: Setzen eines Markers auf die Kurve des Reflektionsfaktors und schrittweise zur gewünschten Frequenz gehen.
ja: グラフにマーカーをセットし、所望の周波数に合わせる。
pt_br: Crie um marcador no gráfico utilizando a opção do menu Inserir>Inserir Marcador no Gráfico e clique em cima da curva, na frequência desejada.
ru: Поместить на график маркер и двигаться шагами к требуемой частоте.
uk: Помістити на графік маркер і рухатися кроками до необхідної частоти.

source: Click with the right mouse button on the marker and select "power matching" in the appearing menu.
cs: Kliknout pravým tlačítkem myši na tvůrce grafu a vyberte "power matching" v právě objeveném menu.
de: Mit der rechten Maustaste auf den Marker klicken und "Leistungsanpassung" in dem erscheinenden Menü auswählen.
ja: マーカの上をマウスの右ボタンでクリックし、現れるメニューで"power matching"を選択する。
pt_br: Clique com o botão direito do mouse no marcador e selecione no menu que aparecer a opção "casamento de potência".
ru: Нажать правую кнопку мыши на маркере и выбрать "согласование мощности" в появившемся меню.
uk: Натиснути праву кнопку миші на маркері і вибрати "узгодження потужності" в меню яке з'явився.

source: A dialog appears where the values can be adjusted, for example the reference impedance can be chosen different from 50 ohms.
cs: Objeví se dialog. Zde si můžete přizpůsobit hodnoty. Např. referenční impedance se může změnit o 50 Ohmů.
de: Es öffnet sich ein Dialogfenster, in dem die Werte auch von Hand angepasst werden können. Die Referenzimpedanz kann beispielsweise von 50 Ohm abweichend gewählt werden.
ja: ダイアログ画面が現れるので値を調整、例えば基準インピーダンスを50オーム以外にすることができます。
pt_br: Uma janela aparecerá onde os valores podem ser ajustados, por exemplo: A impedância de referência pode ser escolhida diferente dos 50 ohms.
ru: Появляется диалоговое окно, в котором можно настроить значения, например, опорное полное сопротивление может быть выбрано отличающимся от 50 Ом.
uk: З'являється діалогове вікно, де можна налаштувати значення, наприклад, повний опорний опір, можливо вибрати відмінним від 50 Ом.

source: After clicking "create" the page switches back to the schematic and by moving the mouse cursor the matching circuit can be placed.
cs: Po kliknutí na "vytvořit" se vrátíte zpátky do schématu a pomocí kurzoru myši můžete umístit vlastní laděný obvod.
de: Nach dem Bestätigen mit dem "Erstellen"-Knopf wird auf den Schaltplan zurückgeschaltet und durch Bewegen der Maus kann die fertige Anpassschaltung eingefügt werden.
ja: "create"をクリックすると、回路図のページに戻るので、マウスのカーソルを動かすことでマッチング回路を配置することができます。
pt_br: Após clicar em "criar" a página retornará para o esquema elétrico e movendo o cursor do mouse, o circuito de casamento poderá ser colocado.
ru: После нажатия на кнопку "создать" происходит возврат к схеме, и с помощью курсора мыши может быть выбрано место для вставки согласованной цепи.
uk: Після натискання на кнопку "створити" відбувається повернення до схеми, і з допомогою курсору миші можна вибрати місце для вставки узгодженого електричного кола.

source: The left-hand side of the matching circuit is the input and the right-hand side must be connected to the circuit.
cs: Levá strana laděného obvodu je vstup a na pravé straně musí být zapojen obvod.
de: Die linke Seite der Anpassschaltung ist der Eingang und die rechte Seite muss mit dem Schaltkreis verbunden werden.
ja: マッチング回路の左側は入力で、右側は回路に接続されなくてはなりません。
pt_br: O lado esquerdo do circuito de casamento é a entrada e o lado direito, deve ser conectado ao circuito.
ru: Левая сторона согласованной цепи является входом, а правая сторона должна быть подсоединена к схеме.
uk: З'являється діалогове вікно, де можна налаштувати значення, наприклад, повний опорний опір, можливо вибрати відмінним від 50 Ом.

source: If the marker points to a variable called "Sopt", the menu shows the option "noise matching". Note that the only different to "power matching" is the fact that the conjugate complex reflexion coefficient is taken. So if the variable has another name, noise matching can be chosen by re-adjusting the values in the dialog.
de: Falls der Marker auf eine Variable namens "Sopt" zeigt, beinhaltet das Menü die Option "Rauschanpassung". Beachte, dass der einzige Unterschied zur "Leistungsanpassung" die Verwendung des konjugiert komplexen Reflektionsfaktors ist. Wenn die Variable also einen anderen Namen hat, kann Rauschanpassung durch eine kleine Änderung der Werte in dem Dialog erreicht werden.
ja: もしマーカーが"Sopt"という変数を指せば、メニューは"noise matching"というオプションを表示します。"power matching"との違いは、複素共役の反射係数が取られるという事実です。それで、もしも変数が別の名前なら、ダイアログ画面で値を再度調整してノイズマッチングを選ぶこともできます。
pt_br: Se os pontos do marcador para uma variável chamada "Sopt", o Menu mostrará a opção "casamento de ruído". Note que a única diferença para "casamento de potência" é o fato de que o coeficiente de reflexão do complexo conjugado é tomado. Então, se a variável tem outro nome, o casamento de ruído pode ser escolhido re-ajustando os valores na janela.
ru: Если маркер указывает на переменную под названием "Sopt", в меню появляется опция "согласование шума". Обратите внимание, что единственным отличием от "согласования мощности" является то, что берется сопряженный комплексный коэффициент отражения. Поэтому, если у переменной другое имя, согласование шума может быть выбрано путем перенастройки значений в диалоговом окне.
uk: Якщо маркер вказує на змінну під назвою "Sopt", в меню появляється опція "узгодження шуму". Зверніть увагу, що єдиною відмінністю від "узгодження потужності" є те, що береться спряжений комплексний коефіцієнт відображення. Тому, коли в змінної друге ім'я, узгодження шуму може бути вибрано шляхом переналаштування значеннів в діалоговому вікні.

source: The matching dialog can also be called by menu (Tools->matching circuit) or by short-cut (<CTRL-5>). But then all values has to be entered manually.
cs: Dialog pro laděné obvody mužete také najít přimo v menu (Nástroje -> Přizpůsobovací obvod) a nebo použít klávesovou zkratku (<CTRL-5>). Potom ale veškeré hodnoty musí být zadány ručně.
de: Der Anpassungsdialog kann auch über das Menü aufgerufen werden (Werkzeuge->Anpassnetzwerk) oder durch das Tastenkürzel (<CTRL-5>). Dann müssen aber alle Werte von Hand eingetragen werden.
ja: マッチングのダイアログ画面は、メニュー（Tools->matching circuit）やショートカット（<CTRL-5>）から呼び出すことができます。しかし、そこではすべての値を手で入れ直さなくてはなりません。
pt_br: A janela de casamento pode ser também chamada pelo Menu (Ferramentas->Circuito de Casamento) ou pelo atalho (<CTRL-5>). Mas então todos os valores tem que ser entrados manualmente.
ru: Диалог создания согласования может быть также вызван с помощью меню (Инструменты->согласование цепи) или с помощью комбинации клавиш (<CTRL-5>). Но тогда все значения должны вводиться вручную.
uk: Діалог здійснення узгодження може бути також викликаний з допомогою меню (Інструменти->узгодження електричних кіл) чи з допомогою комбінації клавіш (CTRL-5). Але всі значення повинні вводитися вручну.

source: 2-Port Matching Circuits
cs: 2-vývodové laděné obvody
de: Zweitor-Anpassungsnetzwerke
ja: ２ポートのマッチング回路
pt_br: Circuitos de Casamento de 2-Portas
ru: Согласование четырехполюсников
uk: Узгодження чотирьохполюсників

source: If the variable name in the marker text is an S-parameter, then an option exists for concurrently matching input and output of a two-port circuit. This works quite alike the above-mentioned steps. It results in two L-circuits: The very left node is for connecting port 1, the very right node is for connectiong port 2 and the two node in the middle are for connecting the two-port circuit.
cs: Pokud název proměnné v tvůrci textu je jako S-parametr, pak tato volba existuje pro současný laděný vstup a výstup dvou-vývodového obvodu. Toto pracuje podobně jako již bylo výše zmíněno. Ve výsledku je vše ve dvou L-ovbodech: Levý uzel je pro propojení s propojkou č. 1. Pravý uzel je pro probopení s propojkou č. 2 a dva uzly vprostřed jsou pro připojení dvou-vývodového obvodu.
de: Falls der Variablenname in dem Marker ein S-Parameter ist, dann existiert ein weiterer Menüpunkt für die gleichzeitige Anpassung am Ein- und Ausgang des Zweitors. Das funktioniert sehr ähnlich wie mit den oben beschriebenen Schritten. Das Ergebnis sind zwei Anpassnetzwerke: Der ganz linke Knoten muss an Tor 1 angeschlossen werden und der ganz rechte Knoten an Tor 2. Die zwei Knoten in der Mitte müssen mit dem Zweitor verbunden werden.
ja: もしもマーカのテキストの変数名がS-parameterなら、２ポート回路の入力と出力を同時にマッチングするオプションもあります。これは、上記のステップと全く同じように動作します。その結果は２つのL回路になります：一番左のノードは、port 1に接続し、一番右のノードはport 2に接続するためのものであり、真ん中の２つのノードは、２ポート回路を接続するものです。
pt_br: Se o nome da variável no marcador de texto for um parâmetro S, então existe uma opção para casar simultâneamente entrada e saída de um circuito de duas portas. Isto funciona de forma completamente semelhante aos passos mencionandos acima. Seus resultados são dois circuitos L: O nó mais a esquerda é para conectar a porta 1, o nó mais a direita é para conectar a porta 2 e os dois nós do meio são para conectar o circuito de duas portas.
ru: Если имя переменной в тексте маркера является S-параметром, то существует возможность одновременного согласования входа и выхода четырехполюсной цепи. Это работает очень похоже на вышеописанные шаги. Результатом являются две согласованные цепи: самый левый узел должен соединяться с портом 1, самый правый узел - с портом 2, а два узла в середине должны соединяться с четырехполюсником.
uk: Якщо ім'я змінної з тексту маркера є S-параметром, то існує можливість одночасного узгодження входу і виходу чотирьохполюсного ланцюга. Це працює досить схоже на вищеописані кроки. Результатом є два узгоджені ланцюга: самий лівий вузол повинен з'єднуватися з виводом 1, більш правий вузол - з виводом 2, а через два вузла у середині повинні з'єднуватися з чотирьохполюсником.
