Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/programs.po
Languages: cs, de, ja, pt, ru, uk

source: Installed Files
cs: Instalované soubory
de: Installierte Dateien
ja: インストールされたファイル
pt: Arquivos Instalados
ru: Установленные файлы
uk: Встановлені файли

source: The Qucs system needs several programs. These are installed during the installation process. The path of Qucs is determined during the installation (``configure`` script). The following explanations assume the default path (``/usr/local/``).
cs: Qucs potřebuje několik programů. Ty josu nainstalovány během instalace. Cesty k Qucs se určují během instalace (configure skript). Následující vysvětlivky předpokládají, že program je nainstalován defaultně do defaultních adresářů (/usr/local/).
de: Das Qucs-System benötgt verschiedene Programme. Diese werden während des Installationsvorgangs mitinstalliert. Der Installationspfad von Qucs wird durch die Parameterübergabe beim Aufruf des Konfigurationsscripts bestimmt (z.B. configure --prefix=/pfad/zum/gewünschten/Verzeichnis). Die folgenden Ausführungen beziehen sich auf den angenommenen voreingestellten Installationpfad (/usr/local/).
ja: Qucsシステムはいくつかのプログラムを必要とします。それらは、インストールプロセスの間にインストールされます。Qucsのパスは、インストール中に決定されます（ ``configure`` スクリプト）。以下の説明では、デフォルトのパス（ ``/usr/local/`` ）を想定しています。
pt: O sistema Qucs precisa de vários programas. Eles são instalados durante o processo de instalação. O diretório de instalação do Qucs é determinada durante a instalação (script configure). As seguintes explicações assumem o diretório padrão (/usr/local/).
ru: В состав Qucs входят несколько программ. Они устанавливаются во время процесса инсталляции. Путь, куда устанавливается Qucs, определяется при установке (скриптом configure). В следующих объяснениях принимается путь по умолчанию (/usr/local/).
uk: До складу Qucs входять кілька програм. Їх встановлюють під час процесу інсталяції. Шлях, куди встановлюється Qucs, визначається при встановленні (скриптом configure). У наступних поясненнях приймається шлях за замовчуванням (/usr/local/).

source: ``/usr/local/bin/qucs`` - the GUI
cs: /usr/local/bin/qucs - GUI - grafické rozhraní
de: /usr/local/bin/qucs - die Benutzeroberfläche (GUI)
ja: ``/usr/local/bin/qucs`` - GUI本体
pt: /usr/local/bin/qucs - a interface gráfica (GUI)
ru: /usr/local/bin/qucs - графический интерфейс
uk: /usr/local/bin/qucs - графічний інтерфейс

source: ``/usr/local/bin/qucsator`` - the simulator (console application)
cs: /usr/local/bin/qucsator - simulátor (aplikace v konzoli)
de: /usr/local/bin/qucsator - Der Simulator (Konsolenprogramm)
ja: ``/usr/local/bin/qucsator`` - シミュレータ本体（コンソールアプリケーション）
pt: /usr/local/bin/qucsator - o simulador (aplicação de console)
ru: /usr/local/bin/qucsator - симулятор (консольное приложение)
uk: /usr/local/bin/qucsator - симулятор (консольна програма)

source: ``/usr/local/bin/qucsedit`` - a simple text editor
cs: /usr/local/bin/qucsedit - jednoduchý textový editor
de: /usr/local/bin/qucsedit - Ein einfacher Texteditor
ja: ``/usr/local/bin/qucsedit`` - シンプルなテキストエディタ
pt: /usr/local/bin/qucsedit - um edito de textos simples
ru: /usr/local/bin/qucsedit - простой текстовый редактор
uk: /usr/local/bin/qucsedit - простий текстовий редактор

source: ``/usr/local/bin/qucshelp`` - a small program displaying the help system
cs: /usr/local/bin/qucshelp - malý program zobrazující nápovědu
de: /usr/local/bin/qucshelp - Ein kleines Programm zur Darstellung der Hilfe-Seiten
ja: ``/usr/local/bin/qucshelp`` - ヘルプシステムを表示する小さなプログラム
pt: /usr/local/bin/qucshelp - um pequeno programa exibindo o sistema de ajuda
ru: /usr/local/bin/qucshelp - небольшая программа для отображения справочной системы
uk: /usr/local/bin/qucshelp - невеличка програма для перегляду довідкової інформації

source: ``/usr/local/bin/qucstrans`` - a program for calculation transmission line parameters
cs: /usr/local/bin/qucstrans - program pro přenos výpočtů a parametrů
ja: ``/usr/local/bin/qucstrans`` - 伝送線路のパラメータを計算するプログラム
pt: /usr/local/bin/qucstrans - um programa para calcular parâmetros de linhas de transmissão
ru: /usr/local/bin/qucstrans - программа для расчета параметров линий передач
uk: /usr/local/bin/qucstrans - програма для розрахунку параметрів ліній передач

source: ``/usr/local/bin/qucsfilter`` - a program synthesizing filter circuits
cs: /usr/local/bin/qucsfilter - program syntetizující filtry obvodů
ja: ``/usr/local/bin/qucsfilter`` - フィルタ回路を合成するプログラム
pt: /usr/local/bin/qucsfilter - um programa que sintetiza circuitos de filtro
ru: /usr/local/bin/qucsfilter - программа синтеза фильтров
uk: /usr/local/bin/qucsfilter - програма синтезу фільтрів

source: ``/usr/local/bin/qucsconv`` - a file format converter (console application)
cs: /usr/local/bin/qucsconv - konvertor formátu souborů (aplikace v konzoli)
de: /usr/local/bin/qucsconv - Ein Dateiformat-Konverter (Konsolenprogramm)
ja: ``/usr/local/bin/qucsconv`` - ファイル形式のコンバータ（コンソールアプリケーション）
pt: /usr/local/bin/qucsconv - um conversor de formato de arquivo (aplicação de console)
ru: /usr/local/bin/qucsconv - преобразователь форматов файлов (консольное приложение)
uk: /usr/local/bin/qucsconv - перетворювач форматів файлів (консольна програма)

source: All programs are stand-alone applications and can be started independently. The main program (GUI)
cs: Všechny programy jsou samostatné aplikace a mohou být spuštěny samostatně. Hlavní program (GUI)
de: Alle Programme sind einzelnen Anwendungen, die unabhängig voneinander gestartet werden können. Die Benutzeroberfläche (GUI)
ja: プログラムはすべてスタンドアローンのアプリケーションですので、別々に開始できます。メインプログラム（GUI）は
pt: Todos os programas são aplicações separadas e podem ser iniciados de forma independente. O programa principal (GUI)
ru: Все программы являются самостоятельными приложениями и могут быть запущены независимо друг от друга. Главная программа (графический интефейс)
uk: Усі програми є самостійними додатками і можуть працювати незалежно один від одного. Головна програма (графічний інтерфейс)

source: calls ``qucsator`` when performing a simulation,
cs: spustí qucsator když provádí simulaci,
de: ruft qucsator auf, wenn eine Simulation durchgeführt werden soll,
ja: シミュレーションを実行する時には、``qucsator`` を呼び出し、
pt: chama qucsator quando executa uma simulação,
ru: вызывает qucsator при выполнении моделирования,
uk: викликає qucsator при виконанні моделювання,

source: calls ``qucsedit`` when showing text files,
cs: spustí qucsedit když zobrazuje textové soubory,
de: ruft qucsedit auf, wenn eine Textdatei angezeigt werden soll,
ja: テキストファイルを表示する時は、 ``qucsedit`` を呼び出し、
pt: chama qucsedit quando mostra arquivos de texto,
ru: вызывает qucsedit, когда показываются текстовые файлы,
uk: викликає qucsedit, коли демонструються текстові файли,

source: calls ``qucshelp`` when showing the help system,
cs: spustí qucshelp když zobrazuje nápovědu,
de: ruft qucshelp auf, wenn die Hilfe-Seiten dargestellt werden sollen,
ja: ヘルプシステムを表示する時は、 ``qucshelp`` を呼び出し、
pt: chama qucshelp quando exibe o sistema de ajuda,
ru: вызывает qucshelp, когда показывается справочная система,
uk: викликає qucshelp, коли показується довідкова система,

source: calls ``qucstrans`` when calling this program from menu "Tools",
cs: spustí qucstrans když spustíme tento program z menu "Nástroje",
ja: "Tools" のメニューから ``qucstrans`` が選択された時は、このプログラムを呼び出し、
pt: chama qucstrans quando este programa é chamado do Menu "Ferramentas",
ru: вызывает qucstrans при вызове этой программы из меню "Инструменты",
uk: викликає qucstrans при виклику цієї програми з меню "Інструменти",

source: calls ``qucsfilter`` when calling this program from menu "Tools",
cs: spustí qucsfilter když spustíme tento program z menu "Nástroje",
ja: "Tools"メニューから``qucsfilter`` が選択された時は、このプログラムを呼び出し、
pt: chama qucsfilter quando este programa é chamado do Menu "Ferramentas",
ru: вызывает qucsfilter при вызове этой программы из меню "Инструменты",
uk: викликає qucsfilter при виклику цієї програми з меню "Інструменти",

source: calls ``qucsconv`` when placing the SPICE component and when performing a simulation with the SPICE component.
cs: spustí qucsconv když umísťujete SPICE komponentu a když vykonává simulaci s SPICE komponentou.
de: ruft qucsconv auf, wenn eine SPICE-Komponente plaziert wird und wenn eine Simulation mit der SPICE-Komponente durchgeführt werden soll.
ja: SPICE用の部品が配置され、そのSPICE部品でシミュレーションを実行する時は、``qucsconv`` が呼び出されます。
pt: chama qucsconv quando é colocado um componente SPICE e é feita uma simulação com ele.
ru: вызывает qucsconv, когда вставляется компонент SPICE и когда выполняется моделирование с использованием компонента SPICE.
uk: викликає qucsconv, коли вставляється компонент SPICE і коли виконується моделювання з допомогою компонента SPICE.

source: Furthermore, the following directories are created during installation:
cs: Krom toho, následující adresáře jsou vytvořeny během instalace:
de: Desweiteren werden die folgenden Verzeichnisse während der Installation erzeugt:
ja: さらに、インストールの間には、以下のようなディレクトリが作られます：
pt: Além disso, os seguintes diretórios são criados durante a instalação:
ru: Аргументы командной строки
uk: Крім цього, за умови встановлення створюються такі папки:

source: ``/usr/local/share/qucs/bitmaps`` - contains all bitmaps (icons etc.)
cs: /usr/local/share/qucs/bitmaps - obsahuje všechny bitmapy (ikony atd.)
de: /usr/local/share/qucs/bitmaps - Enthält alle Bitmap-Bilder (Icons, etc.)
ja: ``/usr/local/share/qucs/bitmaps`` - すべてのビットマップ（アイコンなど）を含みます
pt: /usr/local/share/qucs/bitmaps - contém todas os bitmaps (ícones, etc.)
ru: /usr/local/share/qucs/bitmaps - содержит все растровые изображения (значки и т.д.)
uk: /usr/local/share/qucs/bitmaps - містить всі растрові зображення (значки тощо.)

source: ``/usr/local/share/qucs/docs`` - contains HTML documents for the help system
cs: /usr/local/share/qucs/docs - obsahuje HTML dokumenty, které pak používá nápověda
de: /usr/local/share/qucs/docs - Enthält alle HTML-Dokumente für die Hilfe-Seiten
ja: ``/usr/local/share/qucs/docs`` - ヘルプシステムのHTML文書を含みます
pt: /usr/local/share/qucs/docs - contém documentos HTML para o sistema de ajuda
ru: /usr/local/share/qucs/docs - содержит HTML-документы справочной системы
uk: /usr/local/share/qucs/docs - містить HTML-документи довідкової системи

source: ``/usr/local/share/qucs/lang`` - contains the translation files
cs: /usr/local/share/qucs/lang - obsahuje soubory s překladem
de: /usr/local/share/qucs/lang - Enthält die Datien für die Sprachanpassung
ja: ``/usr/local/share/qucs/lang`` - 翻訳のファイルを含みます
pt: /usr/local/share/qucs/lang - contém os arquivos de tradução
ru: /usr/local/share/qucs/lang - содержит файлы переводов
uk: /usr/local/share/qucs/lang - містить файли перекладів

source: Command line arguments
cs: Příkazová řádka - argumenty
de: Kommandozeilen Argumente
ja: コマンドラインの引数
pt: Argumentos de linha de comando
ru: Аргументы командной строки
uk: Аргументи командного рядку

source: ``qucs [file1 [file2 ...]]``
cs: ``qucs [soubor1 [soubor2 ...]]``
de: ``qucs [Datei1 [Datei2 ...]]``
ru: qucs [файл1 [файл2 ...]]
uk: qucs [файл1 [файл2 ...]]

source: ``qucsator [-b] -i netlist -o dataset`` (b = progress bar)
cs: ``qucsator [-b] -i netlist -o dataset`` (b = ukazatel stavu - progress bar)
de: ``qucsator [-b] -i Netzliste -o Datensatz`` (b = Fortschrittsanzeige)
ja: ``qucsator [-b] -i netlist -o dataset`` (b はプログレスバー)
pt: qucsator [-b] -i netlist -o dataset (b = barra de progresso)
ru: qucsator [-b] -i список_цепей -o набор_данных (b = полоса прогресса)
uk: qucsator [-b] -і список_кіл -o набір_даних (b = смуга прогресу)

source: ``qucsedit [-r] [file]`` (r = read-only)
cs: ``qucsedit [-r] [soubor]`` (r = pouze pro čtení)
de: ``qucsedit [-r] [Datei]`` (r = nur-lesen)
ja: ``qucsedit [-r] [file]`` (r はリードオンリー)
pt: qucsedit [-r] [file] (r = somente leitura)
ru: qucsedit [-r] [файл] (r = только для чтения)
uk: qucsedit [-r] [файл] (r = лише читання)

source: ``qucshelp`` (no arguments)
cs: ``qucshelp`` (bez argumentů)
de: ``qucshelp (keine Argumente)``
ja: 'qucshelp' (引数なし)
pt: qucshelp (sem argumentos)
ru: qucshelp (без аргументов)
uk: qucshelp (без аргументів)

source: ``qucsconv -if spice -of qucs -i netlist.inp -o netlist.net``
de: ``qucsconv -if spice -of qucs -i Netzliste.inp -o Netzliste.net``
uk: qucsconv -if spice -of qucs -і netlist.inp -o netlist.net
