Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/short.po
Languages: cs, de, es, pt_br, ru, uk

source: Short Description of Actions
cs: Krátký popis k ovládání
de: Kurze Beschreibung der Funktionen
es: Descripción breve de las Acciones
pt_br: Descrição Rápida das Ações
ru: Краткое описание действий
uk: Короткий опис дій

source: General Actions
cs: Hlavní ovládání
de: Generelle Funktionen
es: Acciones generales
pt_br: Ações Gerais
ru: Действия общего назначения
uk: Дії загального призначення

source: (valid in all modes)
cs: (platné pro všechny módy)
de: (gültig in allen Betriebszuständen)
es: (válidas para todos los modos)
pt_br: (validas em todos os modos)
ru: (действуют во всех режимах)
uk: колесо миші

source: mouse wheel
cs: kolečko myši
de: Mausrad
es: rueda del ratón
pt_br: roda do mouse
ru: колесо мыши
uk: колесо миші

source: Scrolls vertically the drawing area. You can also scroll outside the current size.
cs: Posouvá vertikálně pracovní oblast.
de: Bewegt den Mauszeiger vertikal durch den Zeichenbereich. Kann auch zum Bewegen außerhalb der gegenwärtigen Größe genutzt werden.
es: esplaza verticalmente el área de dibujo. También se puede desplazar más allá del tamaño actual.
pt_br: Desloca verticalmente a área desenhada. Você pode também deslocar fora do tamanho atual.
ru: Прокручивает область рисования по вертикали. Можно также прокручивать за пределы текущего размера.
uk: Прокручує область малювання по вертикалі. Можна прокручувати за межі поточного розміру.

source: mouse wheel + Shift Button
cs: kolečko myši + klávesa Shift
de: Mausrad + Umstelltaste
es: rueda del ratón + Botón Shift
pt_br: roda do mouse + Botão Shift
ru: колесо мыши + клавиша Shift
uk: колесо миші + клавіша Shift

source: Scrolls horizontally the drawing area. You can also scroll outside the current size.
cs: Posunuje horizontálně pracovní oblsat.
de: Bewegt den Mauszeiger horizontal durch den Zeichenbereich. Kann auch zum Bewegen außerhalb der gegenwärtigen Größe genutzt werden.
es: Desplaza horizontalmente el área de dibujo. También se puede desplazar más allá del tamaño actual.
pt_br: Desloca horizontalmente a área desenhada. Você pode também deslocar fora do tamanho atual.
ru: Прокручивает область рисования по горизонтали. Можно также прокручивать за пределы текущего размера.
uk: Прокручує область малювання по горизонталі. Можна прокручувати за межі поточного розміру.

source: mouse wheel + Ctrl Button
cs: kolečko myši + klávesa Ctrl
de: Mausrad + Ctrl-Taste
es: rueda del ratón + Botón Ctrl
pt_br: roda do mouse + Botão Ctrl
ru: колесо мыши + клавиша Ctrl
uk: колесо миші + клавіша Ctrl

source: Zooms into or outof the drawing area.
cs: Přiblíží, nebo oddálí pracovní oblast.
de: Vergrößert oder verkleinert den betrachteten Zeichen-Bereich.
es: Amplia o reduce el área de dibujo.
pt_br: Aproxima ou afasta a área de desenho.
ru: Увеличивает или уменьшает масштаб области рисования.
uk: Збільшує чи зменшує масштаб області малювання.

source: drag'n'drop file into document area
cs: "přetáhnout" soubor do oblasti s dokumenty (viz Začínáme - Analogové obvody obrázek 1 (5) )
pt_br: arastar e soltar um arquivo dentro da área do documento
ru: перетаскивание файла в документную область
uk: перетягування файлу в документну область

source: Tries to open file as Qucs schematic or data display.
cs: Qucs se pokusí otevřít soubor jako schéma, nebo jako soubor s výstupními daty.
de: (Menüeintrag: Bearbeiten->Auswählen (Esc))
pt_br: Tenta abrir um arquivo como um esquema elétrico ou exibição de dados do Qucs.
ru: Пытается открыть файл как схему Qucs или как документ показа данных.
uk: Намагається відкрити файл як схему Qucs чи як документ показу даних.

source: "Select"-Mode
cs: "Výběr"-Mód
de: linke Maustaste
es: Modo "Seleccionar"
pt_br: Modo "Selecionar"
ru: Режим "Выделения"
uk: Режим "Виділення"

source: |image1_EN|
cs: |image1_CS|
de: |image1_DE|
es: |image1_ES|
pt_br: |image1_PT|
ru: |image1_RU|
uk: |image1_UK|

source: (Menu: Edit->Select)
cs: (Menu: Upravit->Vybrat)
de: (Menüeintrag: Bearbeiten->Auswählen (Esc))
es: (Menu: Edición->Seleccionar)
pt_br: (Menu: Editar->Selecionar)
ru: (Меню: Правка->Выделить)
uk: (Меню: Правка->Виділити)

source: left mouse button
cs: levé tlačítko myši
de: rechte Maustaste
es: botón izquierdo del ratón
pt_br: botão esquerdo do mouse
ru: левая кнопка мыши
uk: ліва кнопка миші

source: Selects the element below the mouse cursor. If several components are placed there, you can clicking several times in order to select the wanted one. Keeping the mouse button pressed, you can move the component below the mouse cursor and all selected ones. If you want to fine position the components, press the CTRL key during moving and the grid is disabled. Keeping the mouse button pressed without any element below it opens a rectangle. After releasing the mouse button, all elements within this rectangle are selected. A selected diagram or painting can be resized by pressing the left mouse button over one of its corners and moving by keeping the button pressed. After clicking on a component text, it can be edited directly. The enter key jumps to the next property. If the property is a selection list, it can only be changed with the cursor up/down keys. Clicking on a circuit node enters the "wire mode".
cs: Vybere komponentu pod kurzorem. Pokud je zde několik komponent, můžete klikat tak dlouho, dokud nebude vybrána taková komponenta, kterou chcete. Pokud necháte tlačítko myši stisklé, můžete komponenty pod kurzorem přesouvat. Pokud chcete nastavit přesně pozici komponent, držte klávesu CTRL během přesouvání. Tím se vypne automatické přichytávání k mřížce. Pokud budete držet tlačítko myši v prázdném poli, vytvoříte obdélník. Po uvolnění myši všechny komponenty umístěné vevnitř obdélníku budou vybrané. Vybrané schéma, nebo kresba může být zvětšena, nebo zmenšena pomocí stisklého levého tlačítka myši na jednom z jeho rohů a přesunutím kurzoru se stisklým tačítkem myši. Po kliknutí na text u komponenty, může být obsah upravován přímo. Po stisknutí Enteru automaticky skočí na další řádek. Pokud je na dalším řádku možnost si vybrat (například ze 2 možností), můžete tyto možnosti projít pomocí šipky nahoru a šipky dolů. Kliknutím v obvodu na uzel vstoupíte do "propojovacího módu".
de: Wählt das Element aus, das sich unter dem Mauszeiger befindet. Wenn sich dort mehrere Komponenten befinden, so kann man einige Mal klicken, bis die gewünschte Komponente ausgewählt ist.Während man die Maustaste gedrückt hält, kann man die Maus bewegen und somit die selektierte Komponente bewegen. Sind mehrere Komponenten ausgewählt, so werden diese alle bewegt.Wird die Maustaste gedrückt, während sich unter ihr kein Element befindet, so öffnet sich ein Rechteck. Durch das Bewegen der Maus bei gedrückter Maustaste wird ein Rechteck aufgezogen. Nach dem Loslassen der Maustaste sind alle Elemente ausgewählt, die sich vollständig innerhalb das Rechtecks befanden.Ein ausgewähltes Diagramm oder eine Zeichnung kann vergrößert oder verkleinert werden, indem man auf eine der Ecken des Diagramms mit dem Mauszeiger klickt und während dessen die Maus bewegt.Nach Drücken auf Komponententext kann dieser direkt editiert werden. Mit der Eingabetaste gelangt man zur nächsten Zeile. Wenn der momentane Komponententext eine Auswahlliste ist, so kann er nur mit den Cursor hoch/runter Tasten verändert werden.
es: Selecciona el elemento que se encuentra debajo del cursor del ratón. Si hay varios componentes ahí, se puede hacer clic ahí varias veces hasta obtener el deseado.Si se mantiene pulsado el botón del ratón, se puede mover el componente que está debajo del cursor del ratón y todos los que estén seleccionados.Si se mantiene el botón del ratón pulsado y nohay ningún elemento debajo, abre un rectángulo. Cuando se suelte el botón del ratón, se seleccionan todos los elementos que estén dentro del rectángulo.Se puede cambiar el tamaño de un diagrama seleccionado o un dibujo presionando el botón izquierdo del ratón sobre una de sus esquinas y moviéndo el ratón sin soltar el botón
pt_br: Seleciona o elemento abaixo do cursor do mouse. Se vários componentes estiverem colocados lá, você pode clicar várias vezes para selecionar o componente desejado. Mantendo o botão do mouse pressionado, você pode mover o componente abaixo do cursor do mouse e todos os outros selecionados. Se você quiser um ajuste fino na posição do componente, pressione a tecla CTRL durante o movimento e a grade será desativada. Mantendo o botão do mouse pressionado sem nenhum elemento por baixo, com seu movimento, aparecerá um retângulo. Após soltar o botão do mouse, todos os elementos dentro deste rectângulo serão selecionados. Um diagrama selecionado ou desenhado pode ser redimensionado pressionando o botão esquerdo do mouse sobre uma de suas bordas e movido mantendo o botão pressionado. Após clicar em um componente de texto, ele pode ser editado diretamente. A tecla ENTER pula para a próxima propriedade. Se a propriedade for uma lista selecionada, ela poderá ser mudada somente com as teclas de cursor cima/baixo. Clicando em um nó do circuito, entrará em "modo fio".
ru: Выделяет элемент, находящийся под курсором мыши. Если там расположено несколько компонентов, то можно нажимать на кнопку несколько раз, чтобы выбрать нужный.Держа эту кнопку мыши нажатой, можно перемещать компонент, находящийся под курсором мыши, и все выделенные компоненты. Если нужно точно разместить компоненты, нажмите при движении клавишу CTRL, и сетка будет отключена.Если держать кнопку мыши нажатой без каких-либо элементов под курсором, то получится прямоугольник. После отпускания кнопки мыши все элементы, находящиеся внутри этого прямоугольника, будут выделены.Размеры выделенной диаграммы или рисунка могут быть изменены, если нажать левую кнопку мыши над одним из углов и двигать курсор, держа кнопку нажатой.Если нажать кнопку мыши на тексте компонента, то его можно непосредственно редактировать. Нажатие клавиши Enter переводит к следующему свойству. Если это свойство является списком выбора, то его можно изменить только с помощью клавиш управления курсором (стрелки вверх/вниз).Если нажать кнопку мыши на узле цепи, то произойдет вход в "режим проводника".
uk: Виділяє елемент, під курсором миші. Якщо міститься кілька компонентів, можна натискати на кнопку кілька разів, аби вибрати потрібний.Тримаючи цю кнопку миші натиснутою, можна переміщати компонент, під курсором миші, і всі виділені компоненти. Якщо потрібно точно розмістити компоненти, натиснімо під час руху клавішу CTRL, і сітка буде відключена.Якщо тримати кнопку миші натиснутої без будь-яких елементів під курсором, вийде прямокутник. Після відпускання кнопки миші всі елементи, що містяться всередині цього прямокутника, виділяться.Розміри виділеної діаграми чи малюнка можуть бути змінені, якщо натиснути ліву кнопку миші над одним з кутів і рухати курсор, тримаючи кнопку натиснутою.Якщо натиснути кнопку миші на тексті компоненту, його можна безпосередньо редагувати. Натискання клавіші Enter переводить до наступної властивості. Якщо ця властивість є списком вибору, то її можна змінити лише за допомогою клавіші управління курсором (стрілки вверх/вниз).Якщо натиснути кнопку миші на вузлі електричного кола, відбудеться вхід в "режим провідника".

source: left mouse button + Ctrl Button
cs: Levé tlačítko myši + klávesa Ctrl
de: linke Maustaste + Ctrl-Taste
es: botón derecho del ratón
pt_br: botão esquerdo do mouse + Botão Ctrl
ru: левая кнопка мыши + клавиша Ctrl
uk: ліва кнопка миші + клавіша Ctrl

source: Allows more than one element to be selected, i.e. selecting an element does not deselect the others. Clicking on a selected element deselects it. This mode is also valid for selecting by opening a rectangle (see item before).
cs: Povolí vybrat více jak jednu komponentu. Například vyberete několik komponent, ale z tohoto výběru pořebujete mít dvě nevybrané. Kliknutím na vybranou komponentu ji odeberete z výběru. Tento mód je také platný pro výběr pomocí obdélníku (podívejte se o odstavec výše).
de: Erlaubt es, mehr als ein einziges Element auszuwählen, z.B. das Auswählen eines Elementes hebt die Auswahl für ein anderes zuvor selektiertes Element nicht auf. Diese Funktion kann ebenfall erreicht werden durch das Aufziehen eines Rechtecks mit der Maus. Dazu wird die linke Maustaste gedrückt und während dessen die Maus bewegt. Alle vollständig in dem Rechteck befindlichen Elemente werden ausgewählt (Eintrag "linke Maustaste" vorher beachten).
es: Permite seleccionar más de un elemento, es decir, que seleccionar un elemento no quite la selección a los demás. Si se hace clic en un elemento seleccionado, lo deselecciona. Este modo también funciona seleccionando mediante un rectángulo, como en el apartado anterior.
pt_br: Permite que mais de um elemento seja selecionado, isto é, selecionar um elemento não desativa a seleção dos outros. Clicando em um elemento selecionado, desativa a seleção dele. Este modo também é valido para seleção feita com retângulo (veja ítem anterior).
ru: Позволяет выделить более одного элемента, то есть, выделение одного элемента не снимает выделения с других. Нажатие кнопки на выделенном элементе приводит к снятию выделения. Этот режим также пригоден для выделения с помощью прямоугольника (см. предыдущий пункт).
uk: Дозволяє виділяти більше елементів, тобто, виділення одного елемента не знімає виділення з інших. Натискання кнопки на виділеному елементі призводить до зняття його виділення. Цей режим також доречний під час виділення з допомогою прямокутника (див. попередній пункт).

source: right mouse button
cs: pravé tlačíko myši
de: "Draht"-Modus
es: Modo "Cablear"
pt_br: botão direito do mouse
ru: правая кнопка мыши
uk: права кнопка миші

source: Clicking on a wire selects a single straight line instead of the complete line.
cs: Kliknutím na vodič vyberete pouze číst vodiče namísto celého vodiče.
de: Klick auf einen Draht selektiert einen einzigen geraden Draht anstatt eines kompletten Leitungszuges.
es: Haciendo clic sobre un cable selecciona una línea recta en lugar de la línea completa.
pt_br: Clicando em um fio, apenas a linha reta é selecionada ao invés da linha inteira.
ru: Нажатие кнопки на проводнике выделяет одну прямую линию, а не весь проводник.
uk: Натискання кнопки на провіднику виділяє одну пряму лінію, а не весь провідник.

source: double-click right mouse button
cs: Dojklik levým tlačítkem myši
de: "Einfügen Komponente"-Modus
es: Modo "Insertar Componente"
pt_br: clique duplo botão direito do mouse
ru: двойное нажатие правой кнопки мыши
uk: подвійне натискання правої кнопки миші

source: Opens a dialog to edit the element properties (The labels of wires, the parameters of components, etc.).
cs: Otevře se okno, ve kterém můžeme měnit vlastnost (značky vodičů, parametry komponent, atd.)
de: Öffnet einen Dialog zum Verändern der Elementeigenschaften (Die Beschriftung von Drähten, die Parameter von Komponenten, etc.).
es: Abre un diálogo que edita las propiedades del elemento (Las etiquetas de los cables, los parámetros de los componentes, etc.).
pt_br: Abre uma janela para editar as propriedades do elemento (O rótulo dos fios, o parâmetro dos componentes, etc.).
ru: Открывает диалог редактирования свойств элемента (метки проводников, параметры компонентов и т.д.).
uk: Відкриває діалог редагування властивостей елемента (мітки провідників, параметри компонентів тощо).

source: "Insert Component"-Mode
cs: "Vložit komponentu"-Mód
de: "Einfügen Komponente"-Modus
es: botón izquierdo del ratón C
pt_br: Modo "Inserir Componente"
ru: Режим "Вставка компонента"
uk: Режим "Вставка компонента"

source: (Click on a component/diagram in the left area)
cs: (Kliknout na komponentu/diagram v levé oblasti)
de: (Klick auf eine Komponente/Diagramm in der Hauptarbeitsfläche)
es: oloca una nueva instancia del componente en el esquema.
pt_br: (Clicar em um componente/diagrama na área esquerda)
ru: (Нажмите на компонент/диаграмму в левой области)
uk: (Натиснімо на компонент/діаграму у лівій області)

source: Place a new instance of the component onto the schematic.
cs: Umístí novou komponentu do schématu.
de: Plaziert eine neue Instanz einer Komponente in das Hauptarbeitsfenster.
es: ota el componente. (No tiene efecto en los diagramas.)
pt_br: Coloca uma nova instância do componente no esquema elétrico.
ru: Поместить новый экземпляр компонента на схему.
uk: Помістити новий примірник компонента на схему.

source: Rotate the component. (Has no effect on diagrams.)
cs: Otočí komponentu. (Neplatí pro diagramy.)
de: (Menüeintrag: Einfügen->Draht (STRG-E))
es: Rota el componente. (No tiene efecto en los diagramas.)
pt_br: Rotaciona o componente. (Sem efeito em diagramas.)
ru: Вращать компонент. (Не действует на диаграммы.)
uk: Крутити компонент. (Не діє на діаграмах).

source: "Wire"-Mode
cs: "Vodič"-Mód
de: linke Maustaste
es: Modo "Cablear"
pt_br: Modo "fio"
ru: Режим "Проводник"
uk: Режим "Провідник"

source: |image2_EN|
cs: |image2_CS|
de: |image2_DE|
es: |image2_ES|
pt_br: |image2_PT|
ru: |image2_RU|
uk: |image2_UK|

source: (Menu: Insert->Wire)
cs: (Menu: Vložit->Vodič)
de: (Menüeintrag: Einfügen->Draht (STRG-E))
es: (Menu: Insertar->Cable)
pt_br: (Menu: Inserir->Fio)
ru: (Меню: Вставка->Проводник)
uk: (Меню: Вставка->Провідник)

source: Sets the starting/ending point of the wire.
cs: Nastaví začítek/konec vodiče.
de: Setzt den Start-/Endpunkt eines Drahtes.
es: Pone el punto de inicio/fin del cable.
pt_br: Define o ponto de início/fim do fio.
ru: Устанавливает начальную/конечную точку проводника.
uk: ліва кнопка миші

source: Changes the direction of the wire corner (first left/right or first up/down).
cs: Změní směr vodiče v rohách (první doleva/dopravas, nebo první nahoru/dolů).
de: Beendet einen Draht ohne an einem Draht oder Port zu sein.
es: ermina un cable sin hacerlo en un cable o en una conexión
pt_br: Muda a direção do canto do fio (primeiro esquerdo/direito ou primeiro cima/baixo).
ru: Изменяет направление изгиба проводника (сперва налево/направо или сперва вверх/вниз).
uk: Змінює напрям вигину провідника (спочатку наліво/направо чи спочатку вверх/вниз).

source: Ends a wire without being on a wire or a port.
de: (Menüeintrag: Bearbeiten->Einfügen (STRG-V))
es: Termina un cable sin hacerlo en un cable o en una conexión
pt_br: Termina um fio sem que seja feita uma conexão com outro fio ou porta.
ru: Заканчивает проводник, не находясь на проводнике или выводе.
uk: Закінчує провідник, не перебуваючи на провіднику чи виводі.

source: "Paste"-Mode
cs: "Vložit"-Mód
de: linke Maustaste
es: Modo "Pegar"
pt_br: Modo "Colar"
ru: Режим "Вставка"
uk: Режим "Вставка"

source: |image3_EN|
cs: |image3_CS|
de: |image3_DE|
es: |image3_ES|
pt_br: |image3_PT|
ru: |image3_RU|
uk: |image3_UK|

source: (Menu: Edit->Paste)
cs: (Menu: Upravit->Vložit)
de: (Menüeintrag: Bearbeiten->Einfügen (STRG-V))
es: (Menu: Edición->Pegar)
pt_br: (Menu: Editar->Colar)
ru: (Меню: Правка->Вставить)
uk: (Меню: Правка->Вставити)

source: Place the elements onto the schematic (from the clipboard).
cs: Umístí komponentu do schématu (ze schránky).
de: Plaziert eine Komponente in dem Hauptarbeitsfenster (aus der Zwischenablage).
es: Coloca los elementos en el esquema (desde el portapapeles).
pt_br: Coloca os componentes no esquema elétrico (da área de transferência).
ru: Поместить элементы на схему (из буфера обмена).
uk: (Меню: Правка->Вставити)

source: Rotate the elements.
cs: klik levým tlačítkem
de: Dreht das Element.
es: clic izquierdo |
pt_br: Rotaciona os elementos.
ru: Вращать элементы.
uk: Крутити елементи.

source: Mouse in "Content" Tab
cs: Myš v záložce "Obsah"
de: Wählt eine Datei aus.
es: Selecciona archivo.
pt_br: Mouse na aba "Conteúdo"
ru: Мышь во вкладке "Содержание"
uk: Миша у вкладці "Зміст"

source: |image4_EN|
es: |image4_ES|
pt_br: |image4_PT|
ru: |image4_RU|

source: left click
cs: dvojklik
de: doppel-Klick
es: doble-clic
pt_br: botão esquerdo do mouse
ru: нажатие левой кнопки
uk: натискання лівої кнопки

source: Selects file.
cs: Otevře soubor.
de: Wählt eine Datei aus.
es: Abre archivo.
pt_br: Seleciona um arquivo.
ru: Выделяет файл.
uk: Виділяє файл.

source: double-click
cs: dvojklik
de: rechts Klick
es: clic derecho |
pt_br: clique duplo com botão esquerdo do mouse
ru: двойное нажатие левой кнопки
uk: [ image ]

source: Opens file.
cs: Otevře soubor.
de: Öffnet eine Datei.
es: Abre archivo.
pt_br: Abre arquivo selecionado.
ru: Открывает файл.
uk: Відкриває файл.

source: right click
cs: Klávesnice
de: Tastatur
es: clic derecho
pt_br: botão direito do mouse
ru: нажатие правой кнопки
uk: натискання правої кнопки

source: Displays menu with:
cs: Zobrazí se menu:
de: Zeigt ein Menü mit:
es: Muestra un menú con:
pt_br: Exibe menu com:
ru: Отображает меню с:
uk: Відображає меню з:

source: "open"
cs: "Otevřít"
de: "Öffnen"
es: "abrir"
pt_br: "abrir"
ru: открыть
uk: "відкрити"

source: open selected file
cs: otevře vybraný soubor
de: Öffnet die ausgewählte Datei
es: abre el archivo seleccionado
pt_br: abre arquivo selecionado
ru: открыть выделенный файл
uk: відкрити виділений файл

source: "rename"
cs: Přejmenovat
de: "Umbenennen"
es: "renombrar"
pt_br: renomear
ru: "переименовать"
uk: "перейменувати"

source: change name of selected file
cs: změní jméno vybraného souboru
de: Ändert den Namen der ausgewählten Datei
es: cambia el nombre del archivo seleccionado
pt_br: muda o nome do arquivo selecionado
ru: изменить имя выделенного файла
uk: змінити ім'я виділеного файлу

source: "delete"
cs: "Smazat"
de: "Löschen"
es: "borrar"
pt_br: excluir
ru: "удалить"
uk: "видалити"

source: delete selected file
cs: Smaže vybraný soubor
de: Löscht die ausgewählte Datei
es: borra el archivo seleccionado
pt_br: apaga o arquivo selecionado
ru: удалить выделенный файл
uk: видалити виділений файл

source: "delete group
cs: "Smazat skupinu"
de: "Gruppe löschen"
es: "borrar grupo"
pt_br: excluir grupo
ru: "удалить группу"
uk: "видалити групу"

source: delete selected file and its relatives (schematic, data display, dataset)
cs: smaže vybraný soubor i data s tím spojená (schémata, výstupy dat, nastavení)
de: Löscht die ausgewählte Datei und alle von ihr abgangigen Dateien (Schematic, Data-Diagramm, Simulationsdaten)
es: borra el archivo seleccionado y todos los relativos a él (esquema, datos mostrados, conjunto de datos)
pt_br: apaga o arquivo selecionado e seus arquivos relacionados (esquema elétrico, exibição de dados, série de dados)
ru: удалить выделенный файл и то, что с ним связано (схему, показ данных, набор данных)
uk: видалити виділений файл і те, що з ним пов'язане (схему, показ даних, набір даних)

source: Keyboard
cs: Klávesnice
de: Tastatur
es: Teclado
pt_br: Teclado
ru: Клавиатура
uk: Клавіатура
