Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/short.po
Languages: cs, de, es, pt_br, ru, uk

source: Many actions can be activated/done by the keyboard strokes. This can be seen in the main menu right beside the command. Some further key commands are shown in the following list:
cs: Mnoho akcí můžeme aktivovat/potrvrdit pomocí klávesnice. Tyto klávesové zkratky můžete najít v hlavním menu. Další klávesové zkratky najdete v tomto seznamu:
de: Viele Aktionen können über Tastatureingaben aktivert/ausgeführt werden. Die zu den Befehlen gehörigen Tastatureingaben kann man immer rechts neben den Texten im Menü finden. Einige weitere Tastaturkommandos sind in der folgenden Liste dargestellt:
es: Hay muchas acciones que se pueden activar/hacer con pulsaciones de teclado. Se pueden ver en el menú principal a la derecha del comando. Algunos comandos muy usados están en esta lista:
pt_br: Muitas ações podem ser ativadas/terminadas pelo teclado. This can be seen in the main menu right beside the command. Some further key commands are shown in the following list:
ru: Многие действия могут быть вызваны/сделаны с помощью клавиш клавиатуры. Выполняемые действия поясняются в строке статуса при выборе команды из главного меню. Некоторые дополнительные команды, выполняемые с помощью клавиш, приводятся в следующем списке:
uk: Багато дій може бути викликано/зроблено з допомогою клавіш клавіатури. Дії що виконуються пояснюються в рядку статусу при виборі команди із меню. Деякі додаткові команди, що виконуються з допомогою клавіш, наводяться в наступному списку:

source: "Delete" or "Backspace"
cs: Šipky doleva/doprava
de: Cursor links/rechts
es: "Suprimir" o "Backspace"
pt_br: "Delete" ou "Backspace"
ru: "Delete" или "Backspace"
uk: "Delete" чи "Backspace"

source: Deletes the selected elements or enters the delete mode if no element is selected.
cs: Smaže vybrané komponenty, nebo se zapne mazací mód, pokud není nic vybráno.
de: Löscht das gegenwärtig ausgewählte Element oder schaltet den "Löschen"-Modus ein, wenn kein Element ausgewählt wurde.
es: Borra los elementos seleccionados o entra en modo borrar si no hay ningún elemento seleccionado.
pt_br: Apaga os elementos selecionados ou entra em modo excluir se nenhum elemento for selecionado.
ru: Удаляет выделенные элементы или входит в режим удаления, если ни один элемент не выделен.
uk: Видаляє виділені елементи чи входить у режим видалення, якщо жоден елемент не виділено.

source: Cursor left/right
cs: Šipky nahoru/dolů
de: Cursor hoch/runter
es: Cursor izquierdo/derecho
pt_br: Cursores esquerda/direita
ru: Клавиши со стрелками влево/вправо
uk: Клавіші зі стрілками вліво/вправо

source: Changes the position of selected markers on their graphs. If no marker is selected, move selected elements. If no element is selected, scroll document area.
cs: Změní pozici vybraných popisovačů v jejich grafech. Pokud není žádny popisovač vybrán, posune vybrané objekty. Pokud není žádná komponenta vybrána, bude se rolovat mezi záložkami dokumentů.
de: Ändert die Position des Markers innerhalb eines Graphen.Wenn kein Marker ausgewählt wurde, werden die selektierten Elemente bewegt.Wenn kein Element ausgewählt wurde, bewegt man sich durch das Dokument.
es: Cambia la posición de los marcadores seleccionados en sus gráficos.Si no hay ningún marcador seleccionado, mueve los elementos seleccionados.Si no hay ningún elemento seleccionado, desplaza el área del documento.
pt_br: Muda a posição dos marcadores selecionados em gráficos. Se nenhum marcador for selecionado, move o elemento selecionado. Se nenhum elemento for selecionado, Desloca a área do documento.
ru: Изменяют положение выделенных маркеров на графиках.Если ни один маркер не выделен, перемещают выделенные элементы.Если ни один элемент не выделен, прокручивают область документа.
uk: Змінюють розташування виділених маркерів на графіках.Якщо жоден маркер не виділено, переміщають виділені елементи.Якщо жоден елемент не виділено, прокручують область документа.

source: Cursor up/down
cs: Tabulátor
de: Tabulator-Taste
es: Cursor arriba/abajo
pt_br: Cursores para cima/ para baixo
ru: Клавиши со стрелками вверх/вниз
uk: Клавіші зі стрілками вверх/вниз

source: Changes the position of selected markers on more-dimensional graphs. If no marker is selected, move selected elements. If no element is selected, scroll document area.
cs: Změní pozici vybraných popisovačů ve více rozměrných grafech.Pokud není žádný popisovač vybrán, po Changes the position of selected markers on more-dimensional graphs.Pokud není žádny popisovač vybrán, posune vybrané objekty. Pokud není žádná komponenta vybrána, bude se rolovat mezi záložkami dokumentů.
de: Ändert die Position des ausgewählten Markers in einem mehrdimensionalen Graphen.Wenn kein Marker ausgewählt wurde, werden die selektierten Elemente bewegt.Wenn kein Element ausgewählt wurde, bewegt man sich durch das Dokument.
es: Cambia la posición de los marcadores seleccionados en gráficos de más dimensiones.Si no hay ningún marcador seleccionado, mueve los elementos seleccionados.Si no hay ningún elemento seleccionado, desplaza el área del documento.
pt_br: Muda a posição de marcadores selecionados em gráficos multi-dimensionais. Se nenhum marcador for selecionado, move o elemento selecionado. Se nenhum elemento for selecionado, Desloca a área do documento.
ru: Изменяют положение выделенных маркеров на многомерных графиках.Если ни один маркер не выделен, перемещают выделенные элементы.Если ни один элемент не выделен, прокручивают область документа.
uk: Змінюють розташування виділених маркерів на багатомірних графіках.Якщо жоден маркер не виділено, переміщають виділені елементи.Якщо жоден елемент не виділено, прокручують область документа.

source: Tabulator
cs: Nahoru
de: Tabulator-Taste
es: Tabulador
pt_br: Tabulador
ru: Клавиша Tab
uk: Клавіша Tab

source: Changes to the next open document (according to the TabBar above).
cs: Skočí na další otevřený dokument. (souhlasně s další záložkou).
de: Geht zum nächsten geöffneten Dokument (bezogen auf die oben vorhandenen Tabulator-Reiter).
es: Cambia al siguiente documento abierto.
pt_br: Muda para o próximo documento aberto (de acordo com a barra de tabulação acima).
ru: Переходит к следующему открытому документы (в соответствие со вкладками).
uk: Переходить до наступного відкритого документу (у відповідності до вкладків).

source: |image0_EN|
cs: |image0_CS|
de: |image0_DE|
uk: |image0_UK|
