Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/start_digi.po
Languages: cs, pt, ru, uk

source: Getting Started with Digital Simulations
cs: Začínáme s Digitálními sumulacemi
pt: Começando com Simulações Digitais
ru: Быстрый старт в цифровом моделировании
uk: Швидкий старт в цифровому моделюванні

source: Qucs is also a graphical user interface for performing digital simulations. This document should give you a short description on how to use it.
cs: Qucs obsahuje také grafické rozhraní umožňující digitální simulace. Tento manuál by vám měl ukázat "Jak nato".
pt: Qucs também é uma interface gráfica para executar simulações digitais. Este documento irá lhe dar uma breve descrição de como usá-la.
ru: Qucs - это также графический интерфейс пользователя для выполнения цифрового моделирования. Этот документ вкратце описывает, как для этого пользоваться Qucs.
uk: Qucs - надає також графічний інтерфейс користувачу для виконання цифрового моделювання. Даний документ коротенько описує, як для цього користовуватись Qucs.

source: For digital simulations Qucs uses the FreeHDL program (`http://www.freehdl.seul.org <http://www.freehdl.seul.org>`__). So the FreeHDL package as well as the GNU C++ compiler must be installed on the computer.
cs: Pro digitální simulace Qucs používá FreeHDL program (http://www.freehdl.seul.org) , takže FreeHDL a GNU C++ kompilátor musí být nainstalován na vašem počítači.
uk: Для цифрового моделювання Qucs використовує програму FreeHDL (http://www.freehdl.seul.org). Тому пакет FreeHDL, разом з компілятором GNU С++ необхідно встановити на комп'ютері.

source: There is no big difference in running an analog or a digital simulation. So having read the `Getting Started for analog simulations <start.html>`__, it is now easy to get a digital simulation work. Let us compute the truth table of a simple logical AND cell. Select the digital components in the combobox of the components tab on the left-hand side and build the circuit shown in figure 1. The digital simulation block can be found among the other simulation blocks.
cs: Zde není příliš velký rozdíl mezi zprovozněním analogové, nebo digitální simulace. Takže pokud jste si přečetli manuál `Začínáme s analogovými simulacemi <start.html>`__, bude pro vás hračka zprovoznit digitální simulaci. Pokud chcete, aby hradlo AND vypadalo jako na ukázkovém obrázku, pak dvakrát klikněte na hradlo a u položky "Symbol" změňte "Old" na "DIN40900". Nechme na programu, aby nám vypočítal pravdivostní tabulku z jednoduchého hradla AND. Vyberte ze skupiny komponent digitální komponenty v comboboxu. Čtverec "Digitální simulace" naleznete v kategorii skupin konponent "Simulace".
pt: Não há grandes diferenças em se executar uma simulação analógica ou uma digital. Tendo lido `Começando com Simulações Analógicas <start.html>`__, fica fácil ter uma simulação digital funcionando. Vamos calcular a tabela verdade de uma simples porta lógica AND. Selecione a classe "componentes digitais" da aba componentes no lado esquerdo e monte o circuito mostrado na figura 1. O bloco de simulação digital pode ser encontrado entre os outros blocos de simulação. As fontes digitais *S1* e *S2* são as entradas, o nó rotulado como *Output* é a saída. Após executar a simulação, a página de exibição de dados abrirá. Coloque o diagrama *tabela verdade* nela e adicione a variável *Output*. Agora, a tabela verdade de uma porta AND de duas entradas é mostrado. Parabéns, a primeira simulação digital terminou!
uk: Немає великої різниці у виконанні аналогового чи цифрового моделювання. Тому після прочитання `Швидкий старт в аналоговому моделюванні <start.html>`__ можна легко домогтися, щоб працювало цифрове моделювання. Давайте розрахуємо таблицю істинності простого логічного елемента І. Виберіть цифрові компоненти що в списку вкладки компонентів зліва і побудуйте схему, зображену на мал. 1. Блок цифрового моделювання можна знайти серед інших блоків моделювання.

source: The digital sources *S1* and *S2* are the inputs, the node labeled as *Output* is the output. After performing the simulation, the data display page opens. Place the diagram *truth table* on it and insert the variable *Output*. Now the truth table of a two-port AND cell is shown. Congratulation, the first digital simulation is done!
cs: Digitální zdroje S1 a S2 jsou vstupy. Uzel nadepsaný jako Output je výstup. Po provedení simulace se otevře okno, ve kterém se vypisují data ze simulace. Umístěte diagram Logická tabulka (Pradivostní tabulka). Vyberte proměnnout Output. Nyní se nám zobrazí pravdivostní tabulka dvou-vstupového hradla AND. Gratuluji, první digitální simulace je hotová!
pt: As fontes digitais *S1* e *S2* são as entradas, o nó rotulado como *Output* é a saída. Após executar a simulação, a página de exibição de dados abrirá. Coloque o diagrama *tabela verdade* nela e adicione a variável *Output*. Agora, a tabela verdade de uma porta AND de duas entradas é mostrado. Parabéns, a primeira simulação digital terminou!
ru: Цифровые источники S1 и S2 подключены ко входам, узел с меткой Output является выходом. После выполнения моделирования открывается страница показа данных. Поместите на нее диаграмму Таблица истинности и вставьте переменную Output. Теперь показывается таблица истинности двух-входового элемента И. Поздравления, первое цифровое моделирование сделано!
uk: Цифрові джерела S1 і S2 підключені до входів, вузол з міткою Output є виходом. Після виконання моделювання відкривається сторінка показу даних. Помістіть на неї діаграму Таблиця істинності і вставте зміну Output. Тепер показується таблиця істинності дво-вхідного елемента І. Поздоровлення, перше цифрове моделювання зроблено!

source: |image0_EN|
cs: |image0_CS|
uk: |image0_UK|

source: Figure 1 - Qucs main window
cs: Obrázek 1 - Qucs - hlavní okno
pt: Figura 1 - Janela principal do Qucs
ru: Рис. 1 - Главное окно Qucs
uk: Мал. 1 - Головне вікно Qucs

source: A truth table is not the only digital simulation that Qucs can perform. It is also possible to apply an arbitrary signal to a circuit and see the output signal in a timing diagram. To do so, the parameter *Type* of the simulation block must be changed to *TimeList* and the duration of the simulation must be entered in the next parameter. The digital sources have now a different meaning: They can output an arbitrary bit sequence by defining the first bit (low or high) and a list that sets the times until the next change of state. Note that this list repeats itself after its end. So, to create a 1GHz clock with pulse ratio 1:1, the list writes: 0.5ns; 0.5ns
cs: Pravdivostní tabluka není jediné, co Qucs zvládne. Je zde také možnost poslat náhodný signál do obvodu a podívat se na na výstup v časovém diagramu. Pro to ale musíme změnit parametr simulace. Vraťte se ke schématu a změňte v Type (stačí jednou kliknout) TruthTable na TimeList. Nebo jednodušeji dvakrát klikněte na ikonu "Digitální simulace" a zde změňte "TruthTable" na "TimeList". Ale během simulace musí být zadán další parametr. Digitální zdroje se nyní chovají jinak. Na jejich výstupech se náhodně mění sekvence bitů od prvního (definovaného) bitu (logická "0" nebo logická "1"). Dále je třeba nastavit seznam, kerý bude určovat kdy se bude měnit jejich logické stavy. Po "přečtení" tohoto seznamu se "přečte" ještě jednou a pak se program ukončí. Takže vytvořme generátor s taktovací frekvencí 1GHz se střídou 1:1, do listu se zapíše: 0.5ns, 0.5ns
pt: Tabela verdade não é a única simulação digital que o Qucs pode efetuar. Também é possível aplicar um sinal arbitrário ao circuito e visualizar o sinal de saída em um diagrama de tempo. Para fazer desta forma, o parâmetro *Tipo* do bloco de simulação deve ser mudado para *TimeList* e a duração da simulação deve ser inserido no próximo parâmetro. As fontes digitais tem agora um comportamento diferente: Elas podem gerar uma sequência aleatória de bits apenas definindo o primeiro bit (baixo ou alto) e uma lista que define os instantes até a nova mudança de estado. Note que esta lista se repete após o seu fim. Então, para criar um clock de 1GHz com razão de pulsos de 1:1, a lista escreve: 0.5ns; 0.5ns Para exibir os resultados desse tipo de simulação, há o diagrama *diagrama de tempo*. Aqui, os resultados de todas os nós de saídas podem ser exibidos linha por linha em um diagrama. Então, vamos nos divertir...
ru: Таблица истинности - не единственный вид моделирования, который может выполнить Qucs. Возможно также подать в схему случайный сигнал и посмотреть выходной сигнал во временной диаграмме. Чтобы это сделать, нужно изменить параметр Type блока моделирования на TimeList и в следующем параметре нужно ввести продолжительность моделирования. Теперь у цифровых источников другой смысл: они могут выдавать случайную последовательность битов, для чего им нужно задать первый бит (низкий или высокий) и список моментов времени следующей смены состояния. Обратите внимание, что этот список повторяется после конца. Поэтому, чтобы получить тактовые импульсы с частотой 1 ГГц и скважностью 1:1, в этом списке должно быть записано: 0.5ns; 0.5ns.
uk: Таблиця істинності - далеко не єдиний вид моделювання, котрий можна виконати в Qucs. Можливо також подати на вхід випадковий сигнал і подивитися вихідний сигнал в часовій діаграмі. Для цього, треба поміняти параметр Type блоку моделювання на TimeList і у наступному параметрі слід ввести тривалість моделювання. Тепер в цифрових джерел інший зміст: вони можуть видавати випадкову послідовність бітів, для цього їм потрібно вказати перший біт (низький чи високий) і список моментів часу наступної зміни стану. Зверніть увагу, що цей перелік повторюється після кінця. Тому, щоб отримати тактові імпульси з частотою 1 ГГц і скважністью 1:1, у списку має бути записано: 0.5ns; 0.5ns.

source: To display the result of this simulation type, there is the diagram *timing diagram*. Here, the result of all output nodes can be shown row by row in one diagram. So, let's have fun...
cs: Pro zobrazení výsledků typu této simualce je zde navržený diagram Časový diagram. Zde mohou býte zobrazeny výsledky všech výstupů za sebou na řádkách. Takže, teď si můžete hrát ;-)
pt: Para exibir os resultados desse tipo de simulação, há o diagrama *diagrama de tempo*. Aqui, os resultados de todas os nós de saídas podem ser exibidos linha por linha em um diagrama. Então, vamos nos divertir...
ru: Для отображения результатов этого типа моделирования есть временнАя диаграмма. В ней результаты всех выходных сигналов могут быть изображены построчно в одной диаграмме. Так что успехов в этом деле...
uk: Для відображення результатів цього моделювання є часова діаграма. У ній результати всіх вихідних сигналів можуть бути зображені пострічково в одній діаграмі. Отож успіхів у цій справі...

source: VHDL File Component
cs: Komponenta VHDL soubor
pt: Componente em arquivo VHDL
ru: Файловый компонент VHDL
uk: Файловий компонент VHDL

source: More complex and more universal simulations can be performed using the component "VHDL file". This component can be picked up from the component list view (section "digital components"). Nevertheless the recommended usage is the following: The VHDL file should be a member of the project. Then go to the content list view and click on the file name. After entering the schematic area, the VHDL component can be placed.
cs: Více složité a více univerzální simulace mohou být zrealizovány použitím komponenty "VHDL soubor". Tuto komponentu můžete najít v skupině komponent "Digitální komponenty". Přesto je však doporučeno, že VHDL soubor by měl být součástí projektu. Vraťte se zpět na "Obsah" a kllikněte na název souboru. Po "vstupu" do schématu by se měla komponenta VHDL vložit
pt: Simulações mais complexas e mais universais podem ser executadas usando o componente "arquivo VHDL". Este componente pode ser encontrado na lista de componentes (seção "componentes digitais"). Todavia, o uso recomendado é o seguinte: O arquivo VHDL deve ser membro do projeto. Então, vá até o visualizador de lista de conteúdo e clique no nome do arquivo. Após entrar na área de esquema elétrico, o componente VHDL pode ser colocado.
ru: Более сложные и более универсальные виды моделирования могут быть выполнены с помощью компонента "файл VHDL". Этот компонент может быть взят из списка компонентов (раздел "цифровые компоненты"). Тем не менее, рекомендуется следующий способ: файл VHDL д олжен быть в составе проекта. Затем перейдите в просмотр содержимого проекта и нажмите на имя файла. Войдя в область построения схем, поместите компонент VHDL.
uk: Більш складні і більш універсальні види моделювання можуть бути виконані з допомогою компонента "файл VHDL". Цей компонент можна взятий з списку компонентів (розділ "цифрові компоненти"). Проте, рекомендується наступний спосіб: файл VHDL повинен бути в складі проекту. Потім перейдіть в перегляд вмісту проекту й натисніть ім'я файла. Зайшовши у область побудови схем, помістіть компонент VHDL.

source: The last entity block in the VHDL file defines the interface, that is, all input and output ports must be declared here. These ports are also shown by the schematic symbol and can be connected to the rest of the circuit. During simulation the source code of the VHDL file is placed into the top-level VHDL file. This must be considered as it causes some limitations. For example, the entity names within the VHDL file must differ from names already given to subcircuits. (After a simulation, the complete source code can be seen by pressing F6. Use it to get a feeling for this procedure.)
cs: Poslední část ve VHDL souboru definuje prostředí, to jsou všechny vstupy a mýstupy. Ty také musejí být deklarovány právě zde. Kontakty jsou rovněž ve schématu a mohou být propojeny se zbytkem obvodu. Během simulace je zdrojový kód VHDL souboru umístěn do nejvyšší úrovně VHDL souboru. Toto musí být šetrné kvůli jistým limitacím. Například celky názvů ve VHDL souboru musí být různé než jsou názvy vnořených obvodů. Po simulaci můžete zobrazit kompletní zdrojový kód stisknutím klávesy F6. Zobrazte si jej pokud se chcete o této proceduře dozvědět více.
pt: O último bloco entidade no arquivo VHDL define a interface, isto é, todas as portas de entrada e saída devem ser declaradas aqui. Essas portas também serão mostradas pelo símbolo no esquema elétrico e podem ser conectadas ao resto do circuito. Durante a simulação, o código fonte do arquivo VHDL é colocado no nível mais alto do arquivo VHDL. Isto deve ser considerado como causa de algumas limitações. Por examplo, o nome das entidades dentro do arquivo VHDL devem ser diferentes dos nomes já dados para subcircuitos. (Após a simulação, o código fonte completo pode ser visto pressionando-se F6. Use-o para adquirir um sentimento por este tipo de procedimento.)
ru: Последний объектный блок в файле VHDL определяет интерфейс, то есть здесь должны быть объявлены все входные и выходные выводы. Эти выводы показываются также на схемном обозначении и могут быть соединены с остальной схемой. Во время моделирования исходный код файла VHDL помещается в VHDL-файл верхнего уровня. Это следует учитывать, поскольку это приводит к некоторым ограничениям. Например, имена объектов в VHDL-файле должны отличаться от имен, уже данных подсхемам. (После моделирования полный исходный код можно увидеть, нажав F6. Пользуйтесь этим, чтобы прочувствовать процедуру.)
uk: Останній об'єктний блок в файлі VHDL визначає інтерфейс, тобто тут повинні бути оголошені всі вхідні і вихідні виводи. Такі виводи показуються також на схемному позначенні і можуть бути з'єднані з іншою схемою. Під час моделювання вихідний код файла VHDL поміститься у VHDL-файл верхнього рівня. Це треба враховувати, оскільки це веде до деяких обмежень. Наприклад, імена об'єктів у VHDL-файлі мають відрізнятись від іменам, вже даних підсхемам. (Після моделювання повний вихідний код можна переглянути, натиснувши F6. Користуйтеся цим, щоб відчути процес.)

source: |image1_EN|
ru: |image1_RU|
