Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/start_opt.po
Languages: cs, de, ja, pt_br, ru, uk

source: Getting Started with Optimization
cs: Začínáme s optimalizací
de: Einführung in die Optimierung
ja: 最適化入門
pt_br: Começando com Otimizações
ru: Быстрый старт в оптимизации
uk: Швидкий старт в оптимізації

source: For circuit optimization, Qucs uses the ASCO tool (`http://asco.sourceforge.net/ <http://asco.sourceforge.net/>`__). A brief description on how to prepare your schematic, execute and interprete the results is given below. Before using this functionality, ASCO must be installed on the computer.
cs: Pro optimalizaci obvodu používá Qucs utilitku ASCO (http://asco.sourceforge.net/). Zde předložím popis jak připravit vaše schéma, jak to celé spustit a jak porozumět výsledkům. Předtím než budete chtít využívat tuto funkci, musíte ASCO nainstalovat na váš počítač.
de: Für die Schaltkreisoptimierung verwendet Qucs ein Programm namens ASCO (http://asco.sourceforge.net/). Es folgt eine kurze Beschreibung, wie man ein Schaltplan dafür vorbereitet, die Optimierung ausführt und die Ergebnisse interpretieren kann. Bevor man diese Funktionalität benutzen kann, muss ASCO auf Ihrem Computer installiert sein.
ja: 回路の最適化のために、QucsはASCOツール（ `http://asco.sourceforge.net/ <http://asco.sourceforge.net/>`__ ）を使用します。あなたの回路図を準備し、実行して結果を解釈する方法について以下に簡単に説明します。この機能を使用する前に、ASCOを、コンピュータにインストールしておく必要があります。
pt_br: Para otimizar circuitos, Qucs usa a ferramenta ASCO (`http://asco.sourceforge.net/ <http://asco.sourceforge.net/>`__). Uma breve descrição de como preparar seu esquema elétrico, executar e interpretar os resultados são dados abaixo. Antes de usar esta funcionalidade, ASCO deve estar instalado no computador.
ru: Для оптимизации цепей в Qucs используется утилита ASCO (http://asco.sourceforge.net/). Ниже дается краткое описание того, как подготовить схему, выполнить утилиту и интерпретировать результат. Перед этим в системе должна быть установлена ASCO.
uk: Для оптимізації ланцюгів в Qucs використовується утиліта ASCO (http://asco.sourceforge.net/). Нижче подається стислий опис того, як підготувати схему, виконати утиліту й інтерпретувати результат. Перед цим у системі слід встановити ASCO.

source: Optimization of a circuit is nothing more than the minimization of a cost function. It can either be the delay or the rise time of a digital circuit, or the power or gain of an analog circuit. Another possibility is defining the optimization problem as a composition of functions, leading in this case to the definition of a figure-of-merit.
cs: Obvod s minimalizací není nic víc, než program, který minimalizuje počet funkcí. Může to být každé časové zpoždění, nebo doba náběžné hrany v digitálních obvodech, nebo jakýkoli zdroj v analogových obvodech. Další možností je definovat optimalizační problém jako skládání funkcí, nebo jako v tomto případě, definovat "figure-of-metir".
de: Die Optimierung eines Schaltkreises ist nicht mehr als die Minimierung einer Kostenfunktion. Das kann entweder die Verzögerungszeit oder die Anstiegszeit in einer digitalen Schaltung, oder die Leistungsverstärkung einer analogen Schaltung sein. Eine andere Möglichkeit ist die Definition des Optimierungsproblems als eine Zusammensetzung von Funktionen, was in diesem Fall zu einem Gütefaktor führt.
ja: 回路の最適化とは、コスト関数の最小化以外の何ものでもありません。これは、デジタル回路の遅延または立ち上がり時間、またはアナログ回路の消費電力または利得とすることができます。そのほかの可能性は、最適化問題を関数の組み合わせとして定義すること、それにより、性能指数を定義することになります。
pt_br: Otimização de um circuito não é nada mais do que a minimização da função custo. Ela poderia ser o atraso no tempo de subida de um circuito digital, ou a potência ou ganho de um circuito analógico. Outra possibilidade é definindo o problema de otimização como sendo uma composição de funções, conduzindo neste caso para a definição de figura-de-mérito.
ru: Оптимизация цепи - это ничто иное, как минимизация функции стоимости. Это может быть время задержки или нарастания цифровой цепи, либо мощность или усиление аналоговой цепи. Еще одна возможность - определить задачу оптимизации как сочетание функций, что в этом случае ведет к определению показателя добротности.
uk: Для підготовки списку зв'язків до оптимізації дві речі потрібно додати до існуючої схеми: потрібно вставити рівняння та блок компонента оптимізації. Візьміть схему з мал. 1 і внесіть у неї зміни такі щоб отримати у результаті схему на мал. 2.

source: To setup a netlist for optimization two things must be added to the already existing netlist: insert equation(s) and the optimization component block. Take the schematic from Figure 1 and change it until you have the resulting schematic given in Figure 2.
cs: Pro nastavení optimalizace musíme dvě věci do schématu přidat: rovnici/rovnice (Vložit -> Vložit rovnici) a velký čtverec s nápisem "Optimalizace" (Ve skupině "Simulace"). Sestavte schéma podle obrázku 1 a hrajte si s Qucs, dikud vaše schéma nebude vypadat jako na obrázku 2 ;-) . Dejte si pozor na znaménko minus u S11_In_Band!
de: Um einen Schaltplan für ein Optimierung vorzubereiten, müssen zwei Dinge hinzugefügt werden: Gleichungen und die Optimierungskomponente. Nehmen Sie den Schaltplan aus Abbildung 1 und verändern Sie es solange, bis Sie den Schaltplan in Abbildung 2 erhalten.
ja: ネットリストを最適化のためにセットアップするには、２つのものを、既存のネットリストに追加する必要があります：方程式（複数可）および最適化コンポーネントブロックの挿入です。図1の回路図をもとに、図2に示される回路図になるまで変更してください。
pt_br: Para configurar uma netlist para otimização, duas coisas devem ser adicionadas a já existente netlist: inserir a(s) equação(ões) e o bloco do componente otimização. Tomando o esquema elétrico da Figura 1 e mudando ele até que que se obtenha o esquema elétrico exibido na Figura 2.
ru: Для подготовки списка связей к оптимизации две вещи должны быть добавлены к уже существующей схеме: нужно вставить уравнение(я) и блок компонента оптимизации. Возьмите схему из рис. 1 и внесите в нее изменения так, чтобы получить в результате схему на рис. 2.
uk: Оптимізація електричних кіл - це ніщо інше, як мінімізація функції вартості. Це може бути час затримки чи наростання цифрового кола, або потужність чи підсилення аналогового електричного кола. Ще один спосіб - визначити завдання оптимізації як поєднання функцій, що в цьому разі веде до визначення показника добротності.

source: |image1_EN|
cs: |image1_CS|
de: |image1_DE|
pt_br: |image1_PT|
ru: |image1_RU|
uk: |image1_UK|

source: Figure 1 - Initial schematic.
cs: Obrázek 1 - Počáteční schéma
de: Abbildung 1 - Ursprünglicher Schaltplan.
ja: 図1 - 起点になる回路図
pt_br: Figura 1 - Esquema elétrico inicial.
ru: Рис. 1 - Исходная схема.
uk: Мал. 1 - Вхідна схема.

source: |image2_EN|
cs: |image2_CS|
de: |image2_DE|
pt_br: |image2_PT|
ru: |image2_RU|
uk: |image2_UK|

source: Figure 2 - Prepared schematic.
cs: Obrázek 2 - Připravené schéma
de: Abbildung 2 - Vorbereiteter Schaltplan.
ja: 図2 - 準備のできた回路図
pt_br: Figura 2 - Esquema elétrico preparado.
ru: Рис. 2 - Подготовленная схема.
uk: Мал. 2 - Підготовлена схема.

source: Now, open the optimization component and select the optimization tab. From the existing parameters, special attention should be paid to 'Maximum number of iterations', 'Constant F' and 'Crossing over factor'. Over- or underestimation can lead to a premature convergence of the optimizer to a local minimum or, a very long optimization time.
cs: Nyní vyberte ze skupin komponent komponentu "Optimalizace". Z existujících parametrů je třeba věnovat speciální pozornost "Maximální počet opakování" , "Konstanta F" a "Přechod přes faktor". Někdy může optimalizace trvat jen chvilinku, ale někdy i celkem dlouho.
de: Jetzt öffnen Sie die Optimierungskomponente und wählen die Algorithmusschaltfläche an. Aus den existierenden Parametern sollte besonders auf 'Maximale Anzahl der Iterationen', 'Constant F' und 'Crossing over factor' geachtet werden. Über- oder Unterschätzung kann zur vorzeitigen Konvergenz des Optimierers in einem lokalen Optimum führen oder auch zu sehr langen Optimierungszeiten.
ja: さて、最適化コンポーネントを開き、最適化タブを選択します。既存のパラメータの中では、‘Maximum number of iterations’（繰り返しの最大数）、 ‘Constant F’ と ‘Crossing over factor’に特別な注意が払われるべきです。過剰または過小な評価は、オプティマイザの不十分な収束や非常に長い最適化時間をもたらします。
pt_br: Agora, abra o componente otimização e selecione a aba Algorítmo. Dos parâmetros existentes, dê atenção especial a 'Número máximo de Iterações', 'Constante F' e 'Fator de cruzamento pelo valor'. Pelo valor- ou subestimação pode levar a uma convergência prematura do otimizador para um mínimo local ou, um tempo muito longo de otimização.
ru: Теперь откройте компонент оптимизации и выберите вкладку 'Алгоритм'. Из имеющихся тут параметров особое внимание должно быть уделено параметрам 'Максимальное число итераций', 'Постоянная F' и 'Фактор пересечения'. Завышение или занижение этих параметров может привести к преждевременной сходимости оптимизатора, к локальному минимуму или к очень долгой оптимизации.
uk: Тепер відкрийте компонент оптимізації і виберіть вкладку оптимізації. З наявних параметрів особливу увагу слід приділити "Максимальному числу ітерацій", "Константі F" і "Фактору перетину". Переоцінка чи недооцінка можуть призвести до передчасної збіжності оптимізатора до локального мінімуму або до дуже тривалого часу оптимізації.

source: |image3_EN|
cs: |image3_CS|
de: |image3_DE|
pt_br: |image3_PT|
ru: |image3_RU|
uk: |image3_UK|

source: Figure 3 - Optimization dialog, algorithm options.
cs: Obrázek 3 - Optimalizace - dialog, možnosti algoritmu.
de: Abbildung 3 - Optimierungsdialog, Algorithmusoptionen.
ja: 図3 - 最適化のダイアログ、アルゴリズムのオプション
pt_br: Figura 3 - Janela de otimização, opção Algorítimo.
ru: Рис. 3 - Диалог оптимизации, параметры алгоритма.
uk: Мал. 3 - Діалог оптимізації, параметри алгоритму.

source: In the Variables tab, defining which circuit elements will be chosen from the allowed range, as shown in Figure 4. The variable names correspond to the identifiers placed into properties of components and **not** the components' names.
cs: V tabulce Proměnné, které definují jednotlivé komponenty bude vybráno z rozsahu, jak je zobrazeno na obrázku 4. Jména proměnných jsou ve shodě s jejich identifikátory umístěných ve vlastnostech komponent a **NE** jmen konponent.
de: Die Variablenschaltfläche, wo die Schaltkreiselemente definiert werden, die in einem bestimmten Interval optimiert werden können, ist in Abbildung 4 dargestellt. Die Variablennamen korrespondieren zu den Namen, die in die Komponenteneigenschaften platziert wurden und **nicht** zu den Namen der Komponenten.
ja: 図4に示すように、Variablesタブでは、どの回路要素を許容範囲から選ぶかを定義します。変数名は、部品のプロパーティに置いた識別子に対応するものであり、部品の名前ではありません。
pt_br: Na aba Variáveis, definimos quais elementos do circuito serão escolhidos e suas faixas de variação, como mostrado na Figura 4. Os nomes das variáveis correspondem aos local do identificadores nas propriedades e **não** ao nome dos componentes.
ru: На вкладке "Переменные" определяется, какие элементы цепи будут выбраны и диапазоны их допустимых значений (рис. 4). Имена переменных соответствуют идентификаторам, помещенным в свойствах компонентов, а не именам компонентов.
uk: На вкладці "Змінні" визначається, які елементи кола буде обрано і діапазони їх допустимих значень (мал. 4). Імена змінних відповідають ідентифікаторам, поміщеним у властивості компонентів, а не іменам компонентів.

source: |image4_EN|
cs: |image4_CS|
de: |image4_DE|
pt_br: |image4_PT|
ru: |image4_RU|
uk: |image4_UK|

source: Figure 4 - Optimization dialog, variables options.
cs: Obrázek 4 - Optimalizace - dialoh, možnosti proměnných.
de: Abbildung 4 - Optimierungsdialog, Variablenoptionen.
ja: 図4 - 最適化のダイアログ、変数のオプション
pt_br: Figura 4 - Janela de otimização, opção Variáveis.
ru: Рис. 4 - Диалог оптимизации, параметры переменных.
uk: Мал. 4 - Діалог оптимізації, параметри змінних.

source: Finally, go to Goals where the optimization objective (maximize, minimize) and constraints (less, greater, equal) are defined. ASCO then automatically combines them into a single cost function, that is then minimized.
cs: Konečně, se dostáváme do cíle kde objekty optimalizace (maximalizace, minimalizace) a omezení (menší, větší, rovno) jsou definovány. Poté ASCO je automaticky zkombinuje do jediné funkce a to je minimalizace.
de: Schließlich müssen noch die Ziele der Optimierung (maximieren, minimieren) und Optimierungsgrenzen (kleiner, größer, gleich) in der Zielschaltfläche eingegeben werden. ASCO kombiniert diese Ziele zu einer einzigen Kostenfunktion, die dann minimiert wird.
ja: 最後に、Goalsのところには、最適化の目標（最大化、最小化）と制約（以下、より大きい、等しく）が定義されています。 ASCOでは自動的にそれらを組み合わせて単一のコスト関数とし、最小化を行います。
pt_br: Finalmente, vá para a aba Metas onde os objetivos de otimização (maximizar, minimizar) e restrições (menor, maior, igual) são definidos. ASCO automaticamente os combinará em uma única função custo que será minimizada.
ru: Наконец, переходите к "Целям", где задаются цели оптимизации (сделать максимальным, сделать минимальным) и ограничения (меньше, больше, равно). Затем ASCO автоматически объединяет их в одну функцию стоимости, которая делается минимальной.
uk: Нарешті, переходите до "Цілі", де задаються цілі оптимізації (зробити максимальним, зробити мінімальним) та обмеження (менше, більше, рівно). Потім ASCO автоматично об'єднує всіх їх в одну функцію вартості, мінімум якої і шукається.

source: |image5_EN|
cs: |image5_CS|
de: |image5_DE|
pt_br: |image5_PT|
ru: |image5_RU|
uk: |image5_UK|

source: Figure 5 - Optimization dialog, goals options.
cs: Obrázek 5 - Optimalizace - dialog, cílové možnosti.
de: Abbildung 5 - Optimierungsdialog, Zieloptionen.
ja: 図5 - 最適化のダイアログ、目標のオプション
pt_br: Figura 5 - Janela otimização, opção Metas.
ru: Рис. 5 - Диалог оптимизации, параметры целей.
uk: Мал. 5 - Діалог оптимізації, параметри цілей.

source: The next step is to change the schematic, and define which circuit elements are to be optimized. The resulting schematic is show in Figure 6.
cs: Dalším krokem je změna schématu a definice které součásti obvodu budou optimalizovány. Výsledné schéma se zobrazeno na obrázku 6.
de: Der nächste Schritt ist die Veränderung des Schaltplans und die Definition der Schaltkreiselemente, die optimiert werden sollen. Der enstehende Schaltplan wird in Abbildung 6 dargestellt.
ja: 次のステップは、回路図を変更し、最適化されるべき回路要素を定義することです。得られた回路図を図6に示します。
pt_br: O próximo passo é mudar o esquema elétrico, e definir quais elementos do circuito serão otimizados. O esquema elétrico resultante é mostrado na Figura 6.
ru: Следующий шаг состоит в изменении схемы и определении, какие элементы требуется оптимизировать. Полученная в результате схема изображена на рис. 6.
uk: Наступний крок полягає у зміні схеми й визначенні, які елементи потрібно оптимізувати. Отримана внаслідок схема зображено на мал. 6.

source: |image6_EN|
cs: |image6_CS|
de: |image6_DE|
pt_br: |image6_PT|
ru: |image6_RU|
uk: |image6_UK|

source: Figure 6 - New Qucs main window.
cs: Obrázek 6 - Nové hlavní okno QUCS
de: Abbildung 6 - Neues Qucs Hauptfenster.
ja: 図6 - 新しいQucsのメインウィンドウ
pt_br: Figura 6 - Nova janela principal do Qucs.
ru: Рис. 6 - Новое главное окно Qucs.
uk: Мал. 6 - Нове головне вікно Qucs.

source: The last step is to run the optimization, i.e. the simulation by pressing F2. Once finished, which takes a few seconds on a modern computer, the best simulation results is shown in the graphical waveform viewer.
cs: Posledním krokem optimalizace je spuštění simulace stisknutím klávesy F2. Simulace může trvat několik sekund na moderním počítači. Nejlepší bude, když si výsledky necháte zobrazit do grafu. Vyberte si diagram kartézský. Přidejte do něj S[2,1] a S[1,1]. Už jen nastavit barvy a tloušťku grafu (čím větší číslo, tím tlustější).
de: Der letzte Schritt ist die Ausführung der Optimierung, d.h. das Starten der Simulation durch Drücken von F2. Wenn die Optimierung beendet ist, was auf einem modernen Computer ein paar Sekunden dauert, werden die besten Simulationsergebnisse angezeigt.
ja: 最後のステップは、最適化を実行して、すなわちF2キーを押してシミュレーションすることです。最新のコンピュータで数秒で終了し、最良のシミュレーション結果はグラフィカルな波形ビューアに表示されます。
pt_br: O último passo é executar a otimização, isto é, executar a simulação pressionando F2. Quando finalizado, que demora poucos segundo em um computador moderno, os melhores resultados da simulação são exibidos em um visualizador de formas de onda gráfico.
ru: Последний шаг - запуск оптимизации, то есть моделирования, нажатием клавиши F2. По кончании работы, на которую на современном компьютере уйдет всего несколько секунд, наилучшие результаты моделирования будут показаны в графическом виде.
uk: Останній крок - запуск оптимізації, тобто моделювання, натисканням клавіші F2. Після завершення роботи, на яку на сучасному комп'ютері піде лише кілька секунд, найкращі результати моделювання постануть в графічному вигляді.

source: |image7_EN|
cs: |image7_CS|
de: |image7_DE|
pt_br: |image7_PT|
ru: |image7_RU|
uk: |image7_UK|

source: Figure 7 - Qucs results window.
cs: Obrázek 7 - Qucs - okno s výsledky.
de: Abbildung 7 - Qucs Ergebnisfenster.
ja: 図7 - Qucsの結果ウィンドウ
pt_br: Figura 7 - Janela de resultados do Qucs.
ru: Рис. 7 - Окно Qucs с результатами.
uk: Мал. 7 - Вікно Qucs з результатами.

source: The best found circuit sizes can be found in the optimization dialog, in the Variables tab. They are now the initial values for each one of introduced variables (Figure 8).
cs: Nejlepší nalezené obvody můžete najít v optimalizačním dialogu v záložce Proměnné. Zde jsou hodnoty pro každý z uvedených prvků (Obrázek 8).
de: Die besten Schaltkreisgrößen findet man im Optimierungsdialog auf der Variablenschaltfläche. Es sind jetzt die Anfangswerte für jede der eingeführten Variablen (siehe Abbildung 8).
ja: これまでで最良の回路のサイズは、Variablesタブの最適化ダイアログにあります。それらは、導入された変数のそれぞれの初期値ということになります（図8）。
pt_br: Os melhores valores para o circuito encontrados podem ser encontrados na janela de otimização, na aba Variáveis. Agora eles são os valores iniciais para cada uma das variáveis introduzidas (Figura 8).
ru: Оптимальные параметры цепи могут быть найдены в диалоге оптимизации, на вкладке "Переменные". Теперь они являются начальными значениями каждой из представленных переменных (рис. 8).
uk: Оптимальні параметри електричного кола можна знайти у діалозі оптимізації, на вкладці "Змінні". Тепер вони є початковими значеннями кожної з представлених змінних (мал. 8).

source: Figure 8 - The best found circuit sizes.
cs: Obrázek 8 - Nejlepší nalezené obvody.
de: Abbildung 8 - Die optimierten Schaltkreisgrößen.
ja: 図8 - 最良の回路の各サイズ
pt_br: Figura 8 - Os melhores valores encontrados para o circuito.
ru: Рис. 8 - Лучшие найденные параметры цепи.
uk: Мал. 8 - Найкращі знайдені параметри електричного кола.

source: By clicking the "Copy current values to equation" button, an equation component defining all the optimization variables with the values of the "initial" column will be copied to the clipboard and can be pasted to the schematic after closing the optimization dialog. The resulting schematic will be as shown in the next figure.
ja: "Copy current values to equation"ボタンをクリックすると、 "initial"のコラムを持っているすべての最適化変数がクリップボードにコピーされ、最適化のダイアログを閉じた後には、回路図にペーストすることができます。結果として得られる回路図は次に示す図のようになります。
pt_br: Clicando no botão "Copiar valores atuais a equação", um componente de equação definindo todas as variáveis de otimização com os valores da coluna "inicial" será copiado para a área de transferência e pode ser colado no esquemático depois de fechar a caixa de diálogo otimização. O esquema resultante será conforme mostrado na figura a seguir.

source: Figure 9 - Schematic with optimized values.
ja: 図9 - 最適化された変数を含む回路図
pt_br: Figura 9 - diagrama esquemático com valores otimizados.
ru: Рис. 9 - Схема с оптимизированными значениями.

source: in case you need to do further modifications to the schematic, the optimization component can now be disabled and the optimized values from the pasted equation will be used.
ja: 回路図をさらに変更する必要がある場合には、最適化のコンポーネントを無効にすれば、ペーストした数式から最適化した値を使うことができます。
pt_br: no caso que você precisa fazer mais modificações de esquema, o componente de otimização agora podem ser desabilitadas e os valores otimizados da equação colado serão usados.
ru: в случае, если вам нужно сделать дополнительные изменения в схеме, компонент оптимизации теперь может быть отключен и будут использоваться оптимизированные значения из вставленного уравнения.

source: You can change the number of figures shown for the optimized values in the optimization dialog by right-clicking on the "initial" table header and selecting the "Set precision" menu, as shown in the following figure.
ja: 最適化ダイアログで最適化した値として表示される数字の桁数は、次の図に示すように、"initial"テーブルのヘッダーの部分で右クリックし"Set precision" メニュを選択することにより変更できます。
pt_br: Você pode alterar o número de figuras mostradas para os valores otimizados na caixa de diálogo otimização clicando sobre o cabeçalho da tabela "inicial" e selecionando o menu "Definir precisão", conforme mostrado na figura a seguir.
ru: Вы можете изменить количество фигур, показанных для оптимизированных значений в диалоге оптимизации, щёлкнув правой кнопкой мыши на "начальном" заголовке таблицы и выбрав меню "Установить точность", как показано на следующем рисунке.

source: Figure 10 - Changing the displayed variables precision.
ja: 図10 - 表示される変数の精度を変更する
pt_br: Figura 10 - Alterando a precisão exibida.
ru: Рис. 10 - Изменение точности отображаемых переменных.

source: |image8_EN|
cs: |image8_CS|
de: |image8_DE|
uk: |image8_UK|
