Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/start.po
Languages: ja, pt_br

source: Getting Started with Qucs Analogue Circuit Simulation
ja: アナログシミュレーション入門
pt_br: Começando com a simulação de circuitos analógicos Qucs

source: Qucs is a scientific/engineering software package for analogue and digital circuit simulation, including linear and non-linear DC analysis, small signal S parameter circuit analysis, time domain transient analysis and VHDL/Verilog digital circuit simulation. This section of the Qucs-Help document introduces readers to the basic steps involved in Qucs analogue circuit simulation. When Qucs is launched for the first time, it creates a directory called ``.qucs`` within the user's home directory. All files involved in Qucs simulations are saved in the ``.qucs`` directory or in one of it's sub-directories. After Qucs has been launched, the software displays a Graphical User Interface window (GUI) similar, or the same, to the one shown in Figure 1.
ja: Qucsは、アナログ回路とデジタル回路のシミュレーションのための科学/工学用ソフトウェアパッケージであり、線形と非線形のDC解析、小信号Sパラメータ回路解析、時間領域のトランジェント解析、それとVHDL/Verilogデジタル回路シミュレーションを含んでいます。Qucs-Help文書のこのセクションでは、読者にQucsのアナログ回路シミュレーションにつての基本的なステップを紹介します。Qucsを初めて起動すると、あなたのホームディレクトリに".qucs"というディレクトリが作成されます。すべてのファイルは、このディレクトリか、その下のサブディレクトリに保存されます。Qucsが開始した後、図1と同じかそれに似たグラフィックユーザインタフェースウィンドウ(GUI)が表示されます。
pt_br: Qucs é um pacote de software científico/engenharia para analógico e simulação de circuitos digitais, incluindo análise de DC linear e não linear, análise de circuito pequeno sinal S parâmetro, análise de transiente de domínio de tempo e simulação de circuitos digitais de VHDL/Verilog. Esta seção do documento Qucs-Help apresenta aos leitores as etapas básicas envolvidas na simulação de circuitos analógicos de Qucs. Quando Qucs é iniciado pela primeira vez, ele cria um diretório chamado ``.qucs`` dentro do diretório home do usuário. Envolvido em simulações Qucs todos os arquivos são salvos no diretório ``.qucs`` ou em um de sub-diretórios. Após Qucs foi lançado, o software exibe uma janela de Interface de usuário gráfica (GUI) semelhante ou igual, ao mostrado na Figura 1.

source: |image2_EN|
pt_br: |image2_PT|

source: Figure 1 - Qucs main window
ja: 図1 - Qucsのメインウィンドウ
pt_br: Figura 1 - Janela principal do Qucs

source: Before using Qucs it is advisable to set the program application settings. This is done from the **File** :math:`\rightarrow` **Application Settings** menu. Clicking on **Application Settings** causes the **EditQucsProperties** window to be displayed, see Figure 2. Complete, with appropriate entries for your Qucs installation, the **Settings**, **Source Code Editor**, **File Types** and **Locations** menus.
ja: Qucsを使い始める前に、プログラムのアプリ設定を行うことをお勧めします。これは、**File** :math:`\rightarrow` **Application Settings** メニューから実行できます。 **Application Settings** をクリックすると、図2に示すような **EditQucsProperties** ウィンドウが表示されます。あなたのQucsインストールについて、 **Settings**, **Source Code Editor**, **File Types** と **Locations** の各メニュの項目に適切な設定を終えてください。
pt_br: Antes de utilizar Qucs é aconselhável definir o programa de configurações do aplicativo. Isso é feito a partir do **Arquivo** :math:`\rightarrow` **Menu de configurações do aplicativo**. Clique em **Aplicativo Configurações** faz com que a janela **EditQucsProperties** seja exibida, consulte a Figura 2. Completo, com as entradas apropriadas para a sua instalação Qucs, as **Configurações**, **Editor de código fonte**, **Typos de arquivos** e **Locais** menus.

source: Figure 2 - QucsEditProperties window
ja: 図2 - QucsEditPropertiesウィンドウ
pt_br: Figura 2 - janela de QucsEditProperties

source: On launching Qucs a working area labelled (6) appears at the centre of the GUI. This window is used for displaying schematics, numerical and algebraic model and circuit design data, numerical output data, and signal waveforms and numerial data visualised as graphs, see Figure 3. Clicking, with the left hand mouse button on any of the entries in the tabular bar labelled (5) allows users to quickly switch between the currently open documents. On the left hand side of the Qucs main window is a third area labelled (1) whose content depends on the status of **Projects** (2), **Content** (3), **Components** (4) or **Libraries**. After running Qucs, the **Projects** tab is activated. However note, when Qucs is launched for the first time the **Projects** list is empty.
ja: Qucsを開始すると、(6)とラベルしたワークエリアがGUIの中央に現れます。このウィンドウは、図3を参照して欲しいのですが、回路図、数値と代数のモデル、回路設計データ、数値出力データ、それから信号波形とグラフとしてビジュアル化した数値データを表示します。(5)とラベルしたテーブル状のバーのどの項目を左マウスボタンでクリックすると、現在開いている文書をすばやく切り替えることができます。Qucsのメインウィンドウの左側は、(1)とラベルした３番目のエリアで、その内容は、 **Projects** (2), **Content** (3), **Components** (4) や **Libraries** の状態に依存します。Qucsを起動すると、 **Projects** タブが有効になります。しかし、Qucsを始めて開始した時は、 **Projects** リストは空であることに注意してください。
pt_br: No lançamento Qucs uma área de trabalho rotulados (6) aparece no centro do GUI. Esta janela é usada para exibir esquemas, numérico e algébrico modelo e projeto de circuito, dados, dados de saída numérica e formas de onda do sinal e numerial visualizado como gráficos, veja a Figura 3. Clicar, com o botão do mouse esquerda em qualquer uma das abas (5) permite aos usuários alternar rapidamente entre os documentos abertos no momento. O lado esquerdo da janela principal do Qucs é uma terceira área rotulada (1) cujo conteúdo depende do estatuto de **Projetos** (2), **Conteúdo** (3), **Componentes* * (4) ou **Bibliotecas**. Depois de executar Qucs, a guia **Projectos** é ativada. Note no entanto, quando Qucs é iniciado pela primeira vez a lista de **Projetos** está vazia.

source: Figure 3 - Qucs main window with working areas labelled
ja: 図3 - Qucsのメインウィンドウとラベルをつけた作業エリア
pt_br: Figura 3 - janela principal Qucs com áreas de trabalho rotulados

source: To enter a new project left click on the **New** button located on the right above window (1). This action causes a Qucs GUI dialogue to open. Enter the name of a Qucs project in the box provided, for example enter *QucsHelpFig* and click on the **OK** button. Qucs then creates a project directory in the ``~/.qucs`` directory. In the example shown in Figure 3 this is called **QucsHelpFig_prj**. Every file belonging to this new project is saved within the **QucsHelpFig_prj** directory. On creation a new project is immediately opened and it's name displayed on the Qucs window title bar. The left tabular bar is then switched to **Content**, and the content of the currently opened project displayed. To save an open document click on the **save** button (or use the main menu: **File** :math:`\longrightarrow` **Save**). This step initiates a sequence which saves the document displayed in area (6). To complete the save sequence the program will request the name of your new document. Enter *firstSchematic*, or some other suitable name, and click on the **OK** button to complete the save sequence.
ja: 新しいプロジェクトを入力するにはエリア(1)のすぐ上にある”New"ボタンを押します。そうすると、QucsのGUIダイアログが開きます。Qucsプロジェクトの名前、例えば *QucsHelpFig* を入力し、 **OK** ボタンを押してください。Qucsは、~/.qucsディレクトリにプロジェクトのディレクトリを作成します。図3の例だと **QucsHelpFig_prj** を作成します。この新しいプロジェクトに属するすべてのファイルは、 **QucsHelpFig_prj** の中に保存されます。作成と同時に新しいプロジェクトはすぐに開かれ、その名前がウィンドウのタイトルバーに表示されます。左側のタブバーは **Content** に切り替わり、現在開いているプロジェクトの内容が表示されます。開いたドキュメントを保存するには、 **save** ボタンをクリックします（またはメインメニュの **File** :math:`\longrightarrow` **Save** を使います）。この操作により、(6)のエリアに表示されたドキュメントの保存処理が始まります。保存処理の最後に、プログラムはあなたの新しいドキュメントの名前を聞いてきます。 *firstSchematic* あるいは適当な名前を入力し、**OK** をクリックして保存処理を完了しましょう。
pt_br: Para inserir um novo projeto clique esquerdo sobre o botão **Novo** localizado no lado direito acima da janela (1). Esta ação faz uma caixa de diálogo abrir. Digite o nome de um projeto de Qucs na caixa fornecida, por exemplo, digite *QucsHelpFig* e clique sobre o botão **Ok**. Qucs, em seguida, cria um diretório de projeto no diretório `` ~/.qucs``. No exemplo mostrado na Figura 3, isso é chamado **QucsHelpFig_prj**. Todos os arquivos pertencentes a este novo projeto é salvo dentro do **QucsHelpFig_prj** diretório. Na criação de um novo projeto é aberto imediatamente e nome é exibido na barra de título janela Qucs. No grupo de abas a esquerda é então ativado **Conteúdo** e o conteúdo do projeto aberto atualmente é exibido. Para salvar um documento aberto, clique sobre o botão **Salvar** (ou use o menu principal: **Arquivo** :math:`\longrightarrow` **Salvar**). Esta etapa inicia uma sequência que salva o documento exibido na área (6). Para completar a sequência de salvar o programa irá solicitar o nome do seu novo documento. Digite * firstSchematic *, ou outros nome apropriado e clique no botão **Okey** para completar a sequência de salvar.

source: As a first example to help you get started with Qucs enter and run the simple DC circuit shown in Figure 3. The circuit illustrated is a two resistor voltage divider network connected to a fixed value DC voltage source. Start by clicking on the **Components** tab. This action causes a combo box to be displayed from which a component group may be choosen and the required components selected. Choose components group **lumped components** and click on the first symbol: **Resistor**. Next move the mouse cursor into area (6). Pressing the right mouse button rotates the **Resistor** symbol. Similarly, pressing the left mouse button places the component onto the schematic at the place the mouse cursor is pointing at. Repeat this process for all components shown in Figure 3. The independent DC voltage source is located in the **sources** group. The ground symbol can be found in the **lumped components** group or selected from the Qucs toolbar. The icon requesting DC simulation is listed in the **simulations** group. To edit the parameters of the second resistor, double-click on it. A dialogue opens which allows the resistor value to be changed; enter *100 Ohm* in the edit field on the right hand side and click enter.
ja: Qucsを始めるのを助ける最初の例として、図3に示す単純なDC回路のシミュレーションを実行します。図示した回路は、固定値のDC電圧源に接続された２つの抵抗からなる分圧回路です。はじめに、**Components** タブをクリックします。そうすると複合ボックスが表示され、部品グループ名とその下に選択されたグループの部品を選ぶことができます。 **lumped components** というグループを選んで、最初のシンボルである **Resistor** をクリックしてください。次に、マウスカーソルをワークエリア（６）に移動します。右のマウスボタンを押すと **Resistor** シンボルは回転します。左マウスボタンを押すと回路図上のマウスカーソルの位置にその部品を配置します。このプロセスを図3に示すすべての部品について繰り返してください。独立電圧源は、 **sources** のグループにあります。グランドシンボルは、 **lumped components** グループかまたはQucsツールバーからとってくることができます。DC解析を実行するアイコンは、 **simulations** グループのリストの中にあります。２つ目の抵抗のパラメータを編集するには、その上でダブルクリックします。ダイアログが開くので抵抗値を変更できます。右側の編集欄に"100 Ohm"と入力し、Enterを押してください。
pt_br: Como um primeiro exemplo para ajudá-lo a começar com Qucs digite e execute o circuito DC simples mostrado na Figura 3. O circuito ilustrado é uma rede de divisor de tensão de dois resistor conectada a uma fonte de tensão DC valor fixo. Comece clicando sobre a aba **Componentes**. Esta ação faz com que uma caixa de combinação seja exibida, da qual um grupo de componentes pode ser escolhidos e os necessários componentes selecionados. Escolha o grupo de componentes **Lumped componentes** e clique no primeiro símbolo: **Resistor**. Em seguida, mova o cursor do mouse para área (6). Pressionar o botão direito do mouse gira o símbolo do **Resistor**. Da mesma forma, pressionar o botão esquerdo do mouse coloca o componente no esquemático no local em que o cursor do mouse está apontando. Repita este processo para todos os componentes mostrados na Figura 3. A fonte de tensão DC independente situa-se no grupo **Fontes**. O símbolo de terra pode ser encontrado no grupo **Lumped componentes** ou selecionado na barra de ferramentas Qucs. O ícone solicitando simulação DC está listado no grupo **Simulações**. Para editar os parâmetros do segundo resistor, clique duas vezes nele. Um diálogo aberto que permite que o valor do resistor a ser alterado; Digite *100 Ohm* no campo editar no lado direito e pressione enter.

source: To connect the circuit components shown in Figure 3, click on the wire toolbar button (or use the main menu: **Insert** :math:`\longrightarrow` **Wire**). Move the cursor onto an open component port (indicated by a small red circle at the end of a blue wire). Clicking on it starts the wire drawing sequence. Now move the drawing cursor to the end point of a wire (normally this is a second red circle attached to a placed component) and click again. Two components are now connected. Repeat the drawing sequence as many times as required to wire up the example circuit. If you want to change the corner direction of a wire, click on the right mouse button before moving to an end point. You can also end a wire without clicking on an open port or on a wire; just double-click the left mouse button.
ja: 図3に示すように回路部品を接続するには、ワイヤーのツールバーボタンを押します（またはメインメニュで、 **Insert** :math:`\longrightarrow` **Wire** を使います）。カーソルを接続されてないポート（青色のワイヤーの端に小さな赤丸で示される）の上に移動します。そのうえでクリックすると配線がスタートします。そこで描画カーソルを最後の点まで移動し（通常そこは配置した部品の２番目の赤丸です）、再度クリックします。こうして２つの部品は接続されます。図の回路の配線のようになるまで、配線処理を必要なだけ繰り返します。 配線の角の向きを変えたい時は、最後の点を決める前に右のマウスボタンをクリックしてください。配線を終えるのは、未配線のポートや配線のうえでクリックしなくてもできます：左のマウスボタンをダブルクリックするだけです。
pt_br: Para conectar os componentes do circuito mostrados na Figura 3, clique no botão de barra de ferramentas de fio (ou use o menu principal: **Inserir** :math:`\longrightarrow` **Fio**). Mova o cursor para uma porta aberta de componente (indicada por um pequeno círculo vermelho na extremidade de um fio azul). Clicando nele começa o sequência do desenho do fio. Agora, mova o cursor de desenho para o ponto de extremidade de um fio (normalmente este é um círculo vermelho segundo anexado a um componente colocado) e clique novamente. Dois componentes estão agora ligados. Repita a sequência de desenho quantas vezes forem necessárias para conectar o circuito de exemplo. Se você quiser mudar a direção do canto de um fio, clique no botão direito do mouse antes de se mudar para um ponto de extremidade. Você também pode finalizar um fio sem clicar em uma porta aberta ou em um fio, basta clicar duas vezes no botão esquerdo do mouse.

source: As a final step before DC simulation label the node, or nodes, who's DC voltage is required, for example the wire connecting resistors **R1** and **R2**. Click on the label toolbar button (or use the menu: **Insert** :math:`\longrightarrow` **Wire Label**). Now click on the chosen wire. A dialogue opens allowing a node name to be entered. Type *divide* and click the **OK** button. If you have drawn the test schematic correctly the entered schematic should look the same, or be similar to, the one shown in Figure 3.
ja: DCシミュレーションの前の最後のステップとして、例えば２つの抵抗 **R1** と **R2** を結ぶ配線のようなDC電圧を見たいノードや複数のノードにラベルを付けます。ラベルツールバーのボタンをクリックします（または **Insert** :math:`\longrightarrow` **Wire Label** メニューを使う）。選んだ配線の上でクリックしてください。ダイアログが開いて、ノード名を入力できるようになります。テスト回路を正しく描画できていれば、入力した回路図は図3と全く同じか似たものになっているはずです。
pt_br: Como um passo final antes da simulação DC rotular o nó, ou nós, os quais a tensão DC é necessária, por exemplo, o fio de ligação entre resistores **R1** e **R2**. Clique no botão de barra de ferramentas de rótulo (ou use o menu: ***Inserir** :math:`\longrightarrow` **Wire Label**). Agora clique sobre o fio escolhido. Um diálogo aberto permitindo que um nome de nó a ser inserido. Entre *divisão* e clique o **Ok** botão. Se você tiver desenhado o esquema de teste correctamente introduzido esquema deve a mesma aparência, ou ser semelhante a, mostrado na Figura 3.

source: To start DC simulation click on the **Simulate** toolbar button (or use menu: **Simulation** :math:`\rightarrow` **Simulate**). A simulation window opens and a sliding bar reports simulation progress. Normally, all this happens so fast that you only see a short flickering on the PC display (this depends on the speed of your PC). After finishing a simulation successfully Qucs opens a data display window. This replaces the schematic entry window labelled (6) in Figure 3. Next the **Components** :math:`\longrightarrow` **diagrams** toolbar is opened. This allows the simulation results to be listed. Click on the **Tabular** item and move it to the display working area, placing it by clicking the left hand mouse button. A dialogue opens allowing selection of the named signals you wish to list, see Figure 4. On the left hand side of the **Tabular** dialogue (called Edit Diagram Properties) is listed the node name: **divide.V**. Double-click on it and it will be transferred to the right hand side of the dialogue. Leave the dialogue by clicking the **OK** button. The DC simulation voltage data for node **divide** should now be listed in a box on the data display window, with a value of 0.666667 volts.
ja: シミュレーションを開始するには、 **Simulate** のツールバーボタンを押します（またはメニュから **Simulation** :math:`\rightarrow` **Simulate** を使う）。シミュレーションウィンドウが開き、シミュレーションの進行状況を知らせるスライドバーが表示されます。通常、これはすべて非常に高速に起きるので、あなたにはPCディスプレイがちょっとの時間ちらついたとしか見えません（もっとも、これはあなたのPCの処理速度に依存しますが）。シミュレーションが成功した後、データディスプレイが開きます。図3で、(6)とラベルされた回路図ウィンドウのかわりに表示されます。続いて、 **Components** :math:`\longrightarrow` **diagrams** ツールバーが開きます。これを使って、シミュレーション結果のリストを表示させることができます。 **Tabular** という項目の上でクリックして、ワークエリアに移動し、左のマウスボタンをクリックしてそれを配置します。ダイアログが開いて、図4に示すように、名前のついた信号をリストから選択できます。左側の **Tabular** 領域（Edit Diagram Propertiesと呼ばれる）に、あなたが定義したノード名 **divide.V** がありますね。その上でダブルクリックするとそれが、右側の領域に送られます。"Ok"ボタンをクリックして、ダイアログを仕舞ってください。すると、シミュレーション結果である0.6666667ボルトがデータ表示ウィンドウのボックスにリスト表示されます。
pt_br: Para iniciar a simulação DC clique sobre o botão **Simular** na barra de ferramentas (ou use o menu: *Simulação** :math:`\rightarrow` **Simular**). A janela de simulação abre e uma barra de deslizamento relata o progresso da simulação. Normalmente, tudo isso acontece tão rápido que a janela é vista brevemente na tela de PC (isso depende da velocidade do seu PC). Depois de terminar uma simulação com êxito Qucs abre uma janela de exibição de dados. Isso substitui a janela de entrada esquemática rotulada (6) na Figura 3. A seguir a aba **Componentes** :math:`\longrightarrow` **diagramas** é aberta. Isso permite que os resultados de simulação ser listado. Clique sobre o item **Tabular* e mova-o para a área de visualização, colocando-o clicando no botão esquerdo do mouse. Uma caixa de diálogo permite a seleção dos sinais que deseja listar, veja a Figura 4. O lado esquerdo do diálogo **Tabular** diálogo (chamado Editar Propriedades do Diagrama) é listado o nome do nó: **divisão.V**. Clique duas vezes nele e ele vai ser transferido para o lado direito do diálogo. Deixe o diálogo clicando o **Ok** botão. Os dados de tensão DC simulação para nó *divisão** agora devem ser listadas em uma caixa na janela de exibição de dados, com um valor de 0,666667 volts.

source: Figure 4 - Qucs data display window showing a **Tabular** dialogue
ja: 図4 - Qucsデータ表示ウィンドウに **Tabular** ダイアログが表示される
pt_br: Figura 4 - Qucs dados exibir mostrando janela um caixa de diálogo **Tabular**
