Repository: Qucs/qucs-help
Catalog: source/locale/*/LC_MESSAGES/subcircuit.po
Languages: ja, pt_br

source: Working with Subcircuits
ja: サブサーキットを使った作業
pt_br: Trabalhando com Subcircuitos

source: Subcircuits are used to bring more clarity into a schematic. This is very useful in large circuits or in circuits, in which a component block appears several times.
ja: サブサーキットは、回路図をよりわかりやすくするために使用されます。これは、大規模回路やコンポーネントのブロックが複数回表示される回路に非常に有用です。
pt_br: Subcircuitos são utilizados para trazer maior clareza ao esquema elétrico. É muito proveitoso em grandes circuitos ou em circuitos em que um bloco de componentes aparece várias vezes.

source: In Qucs, each schematic containing a subcircuit port is a subcircuit. You can get a subcircuit port by using the toolbar, the components listview (in lumped components) or the menu (Insert->Insert port). After placing all subcircuit ports (two for example) you need to save the schematic (e.g. CTRL-S). By taking a look into the content listview (figure 1) you see that now there is a "2-port" right beside the schematic name (column "Note"). This note marks all documents which are subcircuits. Now change to a schematic where you want to use the subcircuit. Then press on the subcircuit name (content listview). By entering the document area again, you see that you now can place the subcirciut into the main circuit. Do so and complete the schematic. You can now perform a simulation. The result is the same as if all the components of the subcircuit are placed into the circuit directly.
ja: Qucsでは、サブサーキットのポートを中に含んでいる回路図はサブサーキットです。サブサーキットのポートを取ってくるには、ツールバー、（lumped componentsの）コンポーネントのリストビューまたはメニュー（Insert->Insert port）を使います。サブサーキットのポート（例えば2個）をすべて配置した後、回路図 は（例えばCTRL-Sを使って）保存する必要があります。コンテンツリストのビュー（図1）をよく見ると、回路図名の横（"Note"欄） に"2-port"が入っていることがわかります。このNoteは、サブサーキットであるすべてのドキュメントにつきます。さて次に、サブサーキットを使いたい回路図に切り替えます。そして、サブサーキット名を（contentのリストビューで）押します。ドキュメントのエリアに再度入ると、サブサーキットをメインの回路図に配置できることがわかると思います。このようにして、回路図を完成します。ここまで来れば、シミュレーションを実行することができます。サブサーキットのすべてのコンポーネントが直接回路内に配置されている場合と、結果は全く同じです。
pt_br: No Qucs, cada esquema elétrico contendo uma conexão para um subcircuito é um subcircuito. Você pode conseguir uma conexão para um subcircuito usando a barra de ferramentas, a listagem de componentes (nos "componentes soltos") ou pelo Menu (Inserir->Inserir Conexão). Após colocar todos as conexões a subcircuitos (dois por exemplo) você precisará salvar o esquema elétrico (e.x. CTRL-S). Dando uma olhada no conteúdo da lista de visualização (figura 1), você agora verá um "2-portas" do lado direito do nome do esquema elétrico (coluna "Nota"). Esta Nota marca todos os documentos que são subcircuitos. Agora mude para o diagrama elétrico que você quer usar o subcircuito. Entao clique no nome do subcircuito (conteúdo da lista de visualização). Movendo o mouse para dentro da área do documento, você verá que agora é possível colocar o subcircuito dentro do circuito principal. Faça então e complete o esquema elétrico. Você agora pode executar uma simulação. O resultado é o mesmo que se todos os componentes do subcircuito fossem colocados diretamente no circuito.

source: |image0_EN|
pt_br: |image0_PT|

source: If you select a subcircuit component (click on its symbol in the schematic) you can step into the subcircuit schematic by pressing CTRL-I (of course, this function is also reachable via toolbar and via menu). You can step back by pressing CTRL-H.
ja: サブサーキット部品を選択し（回路図上でそのシンボルをクリック）、CTRL-Iを押せば（もちろんこの機能はツールバーとメニュからもたどり着けます）、サブサーキットの中に入っていくことができます。CTRL-Hを押すと、もとに戻ります。
pt_br: Se você selecionar um componente subcircuito (clique no seu símbolo no esquema elétrico) você poderá visualizar o esquema elétrico do seu subcircuito pressionando CTRL-I (claro, esta função pode ser alcançada pela barra de tarefas e via Menu). Você pode voltar pressionando CTRL-H.

source: If you do not like the component symbol of a subcircuit, you can draw your own symbol and put the component text at your favourite position. Just make the subcircuit schematic the current and go to the menu: File->Edit Circuit Symbol. If you have not yet drawn a symbol for this circuit. A simple symbol is created automatically. You now can edit this symbol by painting lines and arcs. After finished, save it. Now place it on another schematic, and you have a new symbol.
ja: サブサーキットのシンボルが気に入らなければ、自分で好きなシンボルを描画することも、好みの場所に部品のテキストを配置することもできます。そのためには、そのサブサーキットの回路図をカレントにし、メニューからFile->Edit Circuit Symbolに行ってください。もしも、まだこの回路のシンボルを描画していない場合、簡単なシンボルが自動的に作られます。そこで、このシンボルを線と弧を描画して編集できます。終わったら、それを保存します。ほかの回路図の上にそれを配置すると、新しいシンボルができていることがわかります。
pt_br: Se você não gostar do simbolo de um componente subcircuito, você poderá desenhar seu próprio símbolo e colocar o texto do componente na posição favorita. Apenas abra seu esquema elétrico do subcircuito e vá no Menu: Arquivo->Editar Símbolo do Circuito. Se você nunca desenhou um símbolo para este componente, um símbolo simples é criado automaticamente. Você agora pode editar este símbolo desenhado linhas e arcos. Quando terminar, salve-o. Agora coloque-o em outro esquema elétrico, e você terá um novo símbolo.

source: Just like all other components, subcircuits can have parameters. To create your own parameters, go back to the editor where you edited the subcircuit symbol and double-click on the subcircuit parameter text (SUB1 in the Figure 1). A dialog apperas and you now can fill in parameterswith default values and descriptions. When you are ready, close the dialog and save the subcircuit. In every schematic where the subcircuit is placed, it owns the new parameters which can be edited as in all other components.
ja: ほかのすべての部品とまったく同じように、サブサーキットもパラメータを持つことができます。自分だけのパラメータを作成するには、サブサーキットのシンボルを編集したエディタに戻り、サブサーキットのパラメータのテキスト（図1ではSUB1）をダブルクリックしてください。ダイアログが現れるので、パラメータのデフォルト値と説明を記入することができます。終わったら、ダイアログを閉じ、サブサーキットを保存してください。サブサーキットが配置されたすべての回路で、サブサーキットは新しいパラメータを持つようになり、そのほかの部品と同様に編集可能です。
pt_br: Como todos os outros componentes, subcircuitos podem ter parâmetros. Para criar seus próprios parâmetros, volte para o ediotr onde você editou o símbolo do circuito e dê um duplo clique nos parâmetros de texto do subcircuito. Uma janela aparecerá e você poderá preencher os parâmentros com valores padrões e descrições. Quando estiver pronto, feche a janela e salve o subcircuito. Em cada esquema elétrico que o subcircuito for colocado, ele possuirá novos parâmentros que poderão ser editados como em todos os outros componentes.

source: Subcircuits with Parameters
ja: パラメータを持ったサブサーキット
pt_br: Subcircuitos com parâmetros

source: A simple example using subcircuits with parameters and equations is provided here.
ja: ここでは、パラメータと式をもったサブサーキットの簡単な例を示します。
pt_br: Um exemplo simples usando subcircuitos com parâmetros e equações é fornecido aqui.

source: Create a subcircuit:
ja: サブサーキットを作成する：
pt_br: Criar um sub-circuito:

source: Create a new project
ja: 新しいプロジェクトを作成する
pt_br: Crie um novo projeto

source: New schematic (for subcircuit)
ja: 新しい回路図（サブサーキットのための）
pt_br: Nova esquema (para sub-circuito)

source: Add a resistor, inductor, and capacitor, wire them in series, add two ports
ja: 抵抗、インダクタ、キャパシタを追加し、それらを直列に配線し、２つのポートを加える
pt_br: Adicionar um resistor, indutor e capacitor, conectá-los em série, adicionar duas portas

source: Save the subcircuit as RLC.sch
ja: サブサーキットをRLC.schという名前で保存する
pt_br: Salve o sub-circuito como RLC.sch

source: Give value of resistor as 'R1'
ja: 抵抗に'R1'という値を与える
pt_br: Dar valor de resistor como 'R1'

source: Add equation 'ind = L1',
ja: ‘ind = L1’という式を追加する
pt_br: Adicionar equação ' ind = L1',

source: Give value of inductor as 'ind'
ja: インダクタの値を'ind'とする
pt_br: Dar valor do indutor como 'ind'

source: Give value of capacitor as 'C1'
ja: キャパシタの値を'C1'とする
pt_br: Dar o valor do capacitor como 'C1'

source: Save
ja: 保存する
pt_br: Salvar

source: File > Edit Circuit Symbol
pt_br: Arquivo > Editar Símbolo do Circuito

source: Double click on the 'SUB File=name' tag under the rectangular box
ja: 矩形のボックスの下の‘SUB File=name’ というタグをダブルクリックする
pt_br: Duplo clique sobre o ' SUB arquivo = nome ' etiqueta sob a caixa retangular

source: Add name = R1, default value = 1
ja: name = R1, default value = 1を追加
pt_br: Adicionar nome = R1, valor padrão = 1

source: Add name = L1, default value = 1
ja: name = L1, default value = 1を追加
pt_br: Adicionar nome = L1, valor padrão = 1

source: Add name = C1, default value = 1
ja: name = C1, default value = 1を追加
pt_br: Adicionar nome = C1, valor padrão = 1

source: Insert subcircuit and define parameters:
ja: サブサーキットを挿入しパラメータを定義する：
pt_br: Inserir subcircuito e definir os parâmetros:

source: New schematic (for testbench)
ja: 新しい回路図（テストベンチとして）
pt_br: Nova esquema (para testbench)

source: Save Test_RLC.sch
ja: Test_RLC.schを保存
pt_br: Salve Test_RLC.sch

source: Project Contents > pick and place the above RLC subcircuit
ja: Project のContentsから、上記のRLCサブサーキットを選び、配置する
pt_br: Projeto conteúdo > escolher e colocar o sub-circuito RLC acima

source: Add AC voltage source (V1) and ground
ja: AC 電源 (V1) とグランドを追加する
pt_br: Adicionar fonte de tensão CA (V1) e solo

source: Add AC simulation, from 140Hz to 180Hz, 201 points
ja: AC simulationを140Hz から180Hz, 201点で追加する
pt_br: Adicionar simulação de AC, de 140Hz a 180Hz, 201 pontos

source: Set on the subcircuit symbol
ja: サブサーキットシンボルに以下を設定：
pt_br: Defina no símbolo do sub-circuito

source: Simulate
ja: シミュレート
pt_br: Simular

source: Add a Cartesian diagram, plot V1.i
ja: Cartesian diagramを追加し V1.iをプロットする
pt_br: Adicionar um diagrama cartesiano, plote V1.i

source: The result should be the resonance of the RLC circuit.
ja: 結果は、RLC回路の共振のはず
pt_br: O resultado deve ser a ressonância do circuito RLC.

source: The parameters of the RLC subcircuit can be changed on the top schematic.
ja: RLCサブサーキットのパラメータはトップの回路図から変更できる
pt_br: Os parâmetros do subcircuito RLC podem ser alterados na parte superior esquemática.

source: Figure 1 - Accesing a subcircuit
ja: 図1 - サブサーキットにアクセスする
